import app_icons from '../../../assets/app_icons'
const mn = {
    editBoard : "Группийг засах",
    createBoard : "Шинэ чат",
    groupBoard: "Групп чат",
    privateBoard: "Хувийн чат",
    noMessage: 'Одоогоор мессеж байхгүй',
    fileMessage: 'Файл мессеж',
    boardSearchPlaceHolder: 'Чат, мессеж хайх',
    editInfo: 'Мэдээлэл засах',
    name: 'Нэр',
    phoneNumber: 'Утасны дугаар',
    emailAddress: 'Мэйл хаяг',
    introduction: 'Танилцуулга',
    save: 'Хадгалах',
    unknownError: 'Алдаа гарлаа',
    publicUsers: 'Нээлттэй хэрэглэгчид',
    searchResultOfTag: 'Эдгээр "таг"-ийг агуулсан хэрэглэгчид',
    company: 'Компани',
    occupation: 'Албан тушаал',
    profession: 'Мэргэжил',
    noItemsCurrentlyAvailable: 'Дата алга байна',
    noResultsFound: 'Хайлт илэрцгүй',
    regenerateQrCode: 'QR код шинээр үүсгэх',
    uploadIcon: 'Байршуулах',
    deleteIcon: 'Устгах',
    IconChangeTitle: 'Аккаунт зураг солих',
    unAvailableUserName: 'Идэвхгүй хэрэглэгч',
    checked: 'Баталсан',
    unchecked: 'Батлаагүй',
    confirmToCheck: 'Мэссежийг баталгаажуулах уу?',
    confirm: 'Тийм',
    back: 'Буцах',
    alreadyConfirmed: 'Аль хэдийн баталгаажуулсан байна',
    edit: 'Засах',
    reply: 'Хариулах',
    quot: 'Эш татах',
    share: 'Хуваалцах',
    copy: 'Хуулах',
    delete: 'Устгах',
    checkRequest: 'Баталгаажуулах хүсэлт',
    resendCheckRequest: 'Баталгаажуулах хүсэлт ахин илгээх',
    task: 'Даалгавар',
    note: 'Тэмдэглэл',
    chat: 'Чат',
    canNotAccessChat: 'Чат устсан эсвэл хандах эрхгүй байна',
    noMembersFound: 'Хэрэглэгч олдсонгүй',
    pin: 'Дээд талд байрлуулах',
    unpin: 'Дээд талаас авах',
    detail: 'Дэлгэрэнгүй',
    invite: 'Гишүүн урих',
    privateChat: 'Хувийн чат',
    groupChat: 'Групп чат',
    commonError: 'Алдаа гарлаа',
    confirmToChat: 'Зөвшөөрөх',
    cancelToChat: 'Цуцлах',
    hasNewChatRequest: 'Чат хүсэлт ирлээ',
    sendChatRequest: 'Хувийн чат үүсгэх',
    addToMyMembers: 'Гишүүнээр нэмэх',
    removeFromMyMembers: 'Гишүүнээс хасах',
    inviteMemberFromMenuDetail: 'хэрэглэгчид хувийн чат хүсэлт илгээгдэх болно ',
    inviteMessage: 'Зурвас',
    send: 'Илгээх',
    requestSent: 'Хувийн чатын хүсэлт илгээгдлээ',
    login: 'Нэвтрэх',
    register: 'Бүртгүүлэх',
    password: 'Нууц үг',
    or: 'Эсвэл',
    emailExist: 'Дээрх мэйл хаяг бүртгэлтэй байна',
    phoneExist: 'Дээрх утасны дугаар бүртгэлтэй байна',
    tooManyAttempt: 'Хэт олон оролдлого түр хүлээнэ үү',
    wrongLogin: 'Нэвтрэх нэр эсвэл нууц үг буруу байна',
    sendCodeError: 'Код илгээхэд алдаа гарлаа дахин илгээнэ үү',
    verifyError: 'Баталгаажуулахад алдаа гарлаа дахин оролдоно уу',
    wrongCode: 'Таны оруулсан нэг удаагийн код буруу байна',
    newCode: 'Шинэ нэг удаагийн код илгээсэн',
    verify: 'Баталгаажуулах',
    otp: 'Нэг удаагийн код оруулна уу',
    resendCode: 'Дахин код илгээх',
    required: 'Энэ талбарыг бөглөнө үү',
    max: '100-аас дээш тэмдэгт оруулах боломжгүй',
    passwordCase: 'Нууц үг тоо үсэг агуулсан багадаа 8 тэмдэгт',
    min: 'Багадаа 8 тэмдэгт оруулна уу',
    confirmed: 'Баталгаажуулах нууц үг зөрж байна',
    registerError: 'Алдаа гарсан тул таны бүртгэл амжилтгүй боллоо',
    resetError: 'Алдааны улмаас таны нууц үгийг шинэчлэх амжилтгүй боллоо',
    confPassError: 'Баталгаажуулах нууц үг зөрж байна',
    currentPasswordIsNotMatch: 'Одоогийн нууц үг буруу байна',
    emailOrPhone: 'Мэйл хаяг эсвэл утасны дугаар оруулна уу',
    emailDoesntExist: 'Дээрх мэйл хаяг бүртгэлгүй байна',
    phoneDoesntExist: 'Дээрх утасны дугаар бүртгэлгүй байна',
    sendCode: 'Код илгээх',
    joinOrRemoveRequest: 'Гишүүнээр элссэнээр мессеж илгээх болон унших боломжтой. Гишүүнээр элсэх үү?',
    ableToSendMessageAfterJoin: 'Гишүүн болсоноор мессеж илгээх боломжтой',
    cantChangeLogin: 'Мэйл хаяг талбар заавал байх ёстой',
    success: 'Амжилттай',
    userNotFound: 'Хэрэглэгч олдсонгүй',
    addToFriends: 'Гишүүнээр нэмэх',
    removeFromFriends: 'Гишүүнээс хасах',
    inCompleteTask: 'Дуусаагүй даалгавар',
    completeTask: 'Дууссан даалгавар',
    expiredTask: 'Хугацаа хэтэрсэн даалгавар',
    noTask: 'Одоогоор хийх даалгавар алга',
    inComplete: 'Бүрэн бус',
    finish: 'Дуусгах',
    changeDate: 'Хугацааг өөрчлөх',
    finishToday: 'Хийх',
    deleteField: 'Талбарыг устгахдаа итгэлтэй байна уу?',
    userTag: 'Таг',
    myTask: 'Миний даалгавар',
    lastDate: 'Эцсийн хугацаа',
    title: 'Гарчиг',
    fill: 'Оруулна уу',
    chooseAll: 'Бүх гишүүдийг сонгох',
    chooseMember: 'Гишүүний сонголт',
    cantFindMember: 'Таны хайж буй хэрэглэгч олдсонгүй',
    memo: 'Тэмдэглэл',
    editTask: 'Даалгаврыг засах',
    createTask: 'Шинэ даалгавар',
    changeView: 'Өөрчлөх',
    myMembers: 'Гишүүд',
    searchInMembers: 'Гишүүдээс хайх',
    deleteTaskConfirm: 'Энэ даалгаврыг устгахдаа итгэлтэй байна уу?',
    expired: 'Хугацаа нь дууссан',
    dueDate: 'Хугацаа дуусах дөхөж байна',
    createdTask: 'Шинэ даалгавар үүссэн',
    dueToday: 'Өнөөдөр хугацаа нь дуусах даалгавар байна',
    myProfile: 'Миний профайл',
    profileEdit: 'Профайл засвар',
    personalEdit: 'Аккаунт тохиргоо',
    logout: 'Гарах',
    passwordChanged: 'Нууц үг өөрчлөгдсөн',
    currentPassword: 'Одоогийн нууц үг',
    newPassword: 'Шинэ нууц үг',
    newPasswordConfirm: 'Шинэ нууц үг баталгаажуулах',
    new: 'Шинэ',
    scanQrCode: 'QR код унших',
    qrCode: 'QR код',
    qrExplain: 'Шинээр гишүүд урих үед тухайн хэрэглэгчид энэ QR кодийг уншуулснаар нэмэх боломжтой',
    chatTitle: 'Нэр',
    type: 'Төрөл',
    admin: 'Админ',
    members: 'Гишүүд',
    createdDate: 'Үүсгэсэн өдөр',
    createdBy: 'Үүсгэгч',
    alreadyMember: 'Аль хэдийн гишүүнээр элссэн байна',
    directJoin: 'Группийн гишүүнээр элслээ',
    alreadyHasPrivateBoard: 'Хувийн чат аль хэдийн үүссэн байна',
    openPrivateChat: 'Чатыг нээх',
    openGroupChat: 'Группийг нээх',
    joinToChat: 'Группт нэгдэх',
    cannotMoveFilesBetweenChat: 'Чат хооронд файл зөөх боломжгүй',
    waitingApproval: 'Группийн гишүүдийн зөвшөөрлийг хүлээж байна',
    QrInviteExplaination: 'QR кодоор',
    urlInviteExplaination: 'URL хаягаар',
    copySuccess: 'Хуулагдсан!',
    copyFailed: 'Алдаа гарлаа!',
    loginToJoin: 'Цааш үргэлжлэхийн тулд та системд нэвтрэх шаардлагатай. Хэрэв та бүртгэлгүй бол шинээр бүртгүүлнэ үү',
    confirmToDeleteChat: 'Чат-ийг устгахдаа итгэлтэй байна уу?',
    chooseChatToForward: 'Хуваалцах чатыг сонгоно уу',
    byChat: 'Чат тус бүрээр', 
    byMessage: 'Нийт үр дүн',
    sharedFiles: 'Хуваалцаж буй файлууд',
    validText: 'Үсэг эсвэл тоо оруулна уу',
    validPhone: 'Утасны дугаар оруулна уу',
    validEmail: 'Мэйл хаяг оруулна уу',
    suggestedList: 'Санал болгох',
    selectedMember: 'Сонгогдсон',
    toNext: 'Үргэлжлүүлэх',
    createChat: 'Үүсгэх',
    createNewChat: 'Шинэ чат үүсгэх',
    groupChatTitle: 'Групп нэр',
    Icon: 'Зураг',
    iconPreview: 'Зургийн харагдах байдал',
    imageIsTooBig: 'Зургийн хэмжээ хэтэрхий том байна. 1MB - аас бага хэмжтээтэй зураг оруулна уу',
    enterChatTitleOrSelectUser: 'Чат-ийн нэр хоосон эсвэл гишүүд сонгогдоогүй байна',
    chatIsExistOpenIt: 'Чат өмнө нь үүсгэгдсэн байна. Чатыг нээх үү?',
    privacySettings: 'Нууцлалын тохиргоо',
    closedPrivacy: 'Хаалттай групп (Зөвхөн урилга бүхий хүмүүс нэгдэх боломжтой)',
    openPrivacy: 'Нээлттэй групп (QR код, URL хаяг бүхий хэнд ч нээлттэй)',
    approvalNeeded: 'Гишүүдийн зөвшөөрлөөр баталгаажих',
    byAddedTime: 'Группт элссэн цагаас хойших',
    byAll: 'Бүх хугацааг хамрах',
    messagePermission: 'Мессеж харах эрх',
    newMemberRequest: 'Шинээр гишүүн элсэх',
    groupMembers: 'группийн гишүүд',
    admins: 'Админ',
    addAdmin: 'Админ болгох',
    removeAdmin: 'Админаас хасах',
    adminRemoveConfirm: '<strong>{userName}</strong> гишүүнийг админаас хасахдаа итгэлтэй байна уу?',
    adminMakeConfirm: '<strong>{userName}</strong> гишүүнийг админ болгохдоо итгэлтэй байна уу?',
    memberRemoveConfirm: '<strong>{userName}</strong> гишүүнийг группээс хасахдаа итгэлтэй байна уу?',
    addMemberConfirm: '<strong>{userName}</strong> хэрэглэгчийг группд нэмэхдээ итгэлтэй байна уу?',
    atleastOneAdminIsNeeded: 'Группийн админд багадаа нэг гишүүн байх ёстой',
    errorOnUpload: 'Файл байршуулахад алдаа гарлаа',
    removeMember: 'Группээс хасах',
    addMembers: 'Гишүүн нэмэх',
    inviteDetailedExplaination: 'Та урих гэж буй хүндээ дээрх QR кодыг уншуулах эсвэл URL хаягийг илгээснээр группт нэгдэх боломжтой',
    searchAcrossMyNembersAndPublicUsers: 'Гишүүд болон нээлттэй хэрэглэгчид дундаас хайх',
    enlarge: 'Томруулах',
    editGroupTitle: '<strong>{title}</strong> группийг засах',
    addMembersTitle: 'группт гишүүн нэмэх',
    pendingMembers: 'Хүсэлт гаргасан',
    joinRequestSuccess: 'Группт нэгдэх хүсэлт амжилттай илгээгдлээ',
    fileNotFound: 'Алдаа гарлаа. Файл олдсонгүй',
    messageDeleted: 'Энэ мессежийг устгасан',
    confirmToDeleteMessage: 'Мессежийг устгахдаа итгэлтэй байна уу?',
    languageSetting: 'Хэл',
    darkMode: 'Шөнийн горим',
    accountSettings: 'Миний бүртгэл',
    logOut: 'Системээс гарах',
    sameAsSystem: 'Автомат',
    waitingMembers: 'Хүлээгдэж буй',
    unableToinviteMembersByQr: 'Группийн тохирогоо <strong>Хаалттай групп</strong> байгаа тул QR код болон URL хаягаар гишүүн урих боломжгүй',
    chatIsExistsOpenIt: 'Чат үүсгэгдсэн байна. Чатыг нээх үү?',
    onlyPdfFileUpload: 'Зөвхөн PDF файл дээр цахим гарын үсэг зурах хүсэлт гаргах боломжтой',
    otherUserUsing: '<strong>{userName}</strong> нэртэй хэрэглэгч энэ файл дээр ажиллаж байна',
    confirmToDeleteIcon: 'Зургийн устгахдаа итгэлтэй байна уу?',
    qrExplaination: 'Хэрэглэгч бүр дахин давтагдашгүй QR кодтой байх ба та бусадтай, бусад хэрэглэгчид тантай холбоо тогтоохдоо QR кодыг уншуулахад л хангалттай',
    qrCaution: 'Санамж: Шаардлагатай үед та QR кодыг дахин үүсгэх боломжтой. Дахин үүсгэсэн тохиолдолд өмнөх QR кодыг ашиглах боломжгүй болохыг анхаарна уу',
    confirmToGenerateQr: 'QR кодыг шинээр үүсгэх үү? <br><br><strong>Санамж:</strong> Дахин үүсгэсэн тохиолдолд өмнөх QR кодыг ашиглах боломжгүй болохыг анхаарна уу',
    publicProfile: 'Нээлттэй хэрэглэгч',
    publicProfileExplaination: 'Нээллтэй',
    intro: 'Танилцуулга',
    resetPassword: 'Нууц үг солих',
    deleteAccount: 'Аккаунт устгах',
    registeredDate: 'Системд бүртгүүлсэн огноо',
    passwordUpdatedSuccessfully: 'Нууц үг амжилттай солигдлоо',
    deleteAccountWarning: 'Бүртгэл устгахдаа итгэлтэй байна уу?<br><strong>Анхааруулга!</strong> энэ үйлдэл нь буцаах боломжгүй ба таны бүртгэл ахин сэргэх боломжгүй',
    rootDirectory: 'Yндсэн файлын хавтас',
    trashDirectory: 'Хогийн сав',
    newFolder: 'Шинэ хавтас',
    fileSearch: 'Файл・хавтас хайх',
    restoreFile: 'Файл・хавтас сэргээх',
    emptyTrash: 'Хогийн сав хоослох',
    paste: 'Paste',
    selectAll: 'Бүгдийг сонгох',
    fileName: 'Файлын нэр',
    fileSize: 'Файлын хэмжээ',
    fileDate: 'Файлын он сар өдөр',
    createNew: 'Шинээр үүсгэх',
    chatFile: 'Чатны файл',
    myFile: 'Миний файл',
    editFolder: 'Хавтас засварлах',
    changeFolderName: 'Хавтасны нэр өөрчлөх',
    emptyFolderName: 'Нэр хоосон байж болохгүй',
    lessCharacter: 'Цөөн тэмдэгт оруулна уу',
    invalidCharacter: 'Нэр буруу тэмдэгт агуулж байна',
    folder: 'Хавтас',
    file: 'Файл',
    fileNameExist: 'Хавтасны нэр аль хэдийн байна',
    download: 'Татах',
    cut: 'Зөөх',
    cancelCopy: 'Хуулах эсвэл зөөх үйлдлийг цуцалсан',
    toContinueSelectMembers: 'Группийн гишүүдийг сонгоно уу',
    cancelCut: 'Файлуудыг чат хооронд зөөх боломжгүй',
    fileCreator: 'Файл байршуулсан',
    searchResultOfFile: 'Хайлтын үр дүн',
    myTask: 'Миний даалгавар',
    calendar: 'Календар',
    allTask: 'Бүх даалгавар',
    sortBy: 'Эрэмбэлэх',
    fullScreen: 'Бүтэн дэлгэц',
    motto: 'Бизнесийг эргэлтэнд оруулна',
    terms: 'Үйлчилгээний нөхцөл',
    privacy: 'Нууцлалын бодлого',
    searchFromMessage: 'Мессеж хайлт',
    searchWordForMessage: 'Түлхүүр үг оруулна уу',
    search: 'Хайх',
    subject: 'Сэдэв',
    taskComplete: 'Даалгавар дууссан',
    unsupportedFile: 'Энэ файлыг урьдчилан харах боломжгүй',
    signatureRequest: 'Гарын үсгийн хүсэлт',
    drawSignature: 'Гарын үсэг зурах',
    eraseSignature: 'Буцаах',
    pdfSave: 'Байршуулах',
    draw: 'Зурах',
    scroll: 'Хөдөлгөх',
    fileDrop: 'Файл буулгах талбар ',
    clickToEnlarge: 'Томруулахын тулд дарна уу',
    codeExpired: 'Баталгаажуулах кодын хугацаа дууссан',
    close: 'Хаах',
    foundUser: 'Энэ хэрэглэгчийг хайсан уу?',
    foundGroup: 'Энэ чатыг хайсан уу?',
    inValidQrCode: 'Системд танигдахгүй QR код байна',
    groupIsPrivate: 'Групп хаалттай тул гишүүнээр элсэх боломжгүй',
    agreeTerms: 'Би "Үйлчилгээний нөхцөл"-тэй бүрэн танилцсан ба зөвшөөрч байна',
    readTerms: 'Үйлчилгээний нөхцөлтэй танилцана уу',
    resetPasswordCode: 'Баталгаажуулах код илгээх',
    addedMultipleMembers: '<strong>{userList}</strong> нар группд нэгдлээ',
    addedOneMember: '<strong>{userList}</strong> группд нэгдлээ',
    removedMultipleMembers: '<strong>{userList}</strong> нар группээс гарлаа',
    removedOneMember: '<strong>{userList}</strong> группээс гарлаа',
    invitedOneMember: '<strong>{userList}</strong> группт уригдлаа',
    invitedMultipleMembers: '<strong>{userList}</strong> нар группт уригдлаа',
    rejectedRequest: '<strong>{userList}</strong> группт нэгдэхээс татгалзлаа',
    moreView: 'Цааш унших',
    lessView: 'Хаах',
    newMessagesWithCount: '{num} шинэ мессеж',
    newMessages: 'Шинэ мессеж',
    resultNumber: '{total} мессеж',
    signRequestMember: 'Гарын үсэгний хүсэлт гаргах гишүүнээ сонгоно уу',
    confirmRequestMember: 'Баталгаажуулах хүсэлт гаргах гишүүнээ сонгоно уу',
    sufficientAdministrativePermission: 'Та уг үйлдлийг хийх эрхгүй байна',
    select: 'Сонгох',
    requestEmail: 'Сонгосон гишүүдэд баталгаажуулах мэйл илгээгдэх болно',
    emailSendVerify: 'Та итгэлтэй байна уу',
    request: 'Гарын үсэг',
    requestSuccessful: 'Баталгаажуулах хүсэлт амжилттай илгээгдлээ',
    emailSentSuccessful: 'Мэйл амжилттай илгээгдлээ',
    fileImported: 'Файл импортолсон',
    fileLimitCantCopy: 'Файлын хязгаар хэтэрсэн тул хуулах боломжгүй',
    cutSuccess: 'Зөөгдсөн!',
    fileLimitCantUpload: 'Файлын хязгаар хэтэрсэн тул байршуулах боломжгүй',
    fileSizeLimit: 'Файлын дээд хэмжээ 25 МБ байна',
    deleted: 'Устгагдсан',
    Unauthenticated: 'Хэрэглэгчийн бүртгэл системд танигдсангүй. Дахин ачааллана уу',
    netWorkError: 'Холболтын алдаа гарлаа. Дахин ачааллана уу',
    memberAttachSuccess: 'Гишүүний хүсэлт илгээлээ',
    memberDetachSuccess: 'Гишүүнээс хаслаа',
    thisMonth: 'Энэ сар',
    color: 'Миний өнгө',
    colorExplaination: 'Даалгавар болон тэмдэглэл хэсэгт таны үүсгэсэн дата сонгогдсон өнгөөр харагдана',
    copySuccess: 'Амжилттай хуулагдлаа!',
    copyingItems: '{num} өгөгдөл хуулж байна',
    movingItems: '{num} өгөгдөл зөөж байна',
    searchFiles: 'Файлийн нэр, өргөтгөл, байршуулагчийн нэр...',
    taskSelectMember: 'Даалгавар харахыг хүссэн гишүүнээ сонгоно уу',
    selectUser: 'Гишүүн сонгох',
    noMessagesFound: 'Мэссеж олдсонгүй',
    searchMessageAllChat: 'Бүх чат-д мессеж хайх',
    searchMessageCurrentChat: '"{chatName}"-д мессеж хайх',
    foundChats: 'Чат илэрц',
    inAllChat: 'Бүх чат',
    whyTaskExpired: 'Тогтоосон хугацаанд дуусгаагүй шалтгааныг сонгоно уу',
    tookTimeToComplete: 'Даалгавраа дуусгахад багагүй хугацаа зарцуулсан',
    changeTaskPriority: 'Даалгаврын тэргүүлэх чиглэлийг өөрчилсөн',
    forgotToClickComplete: 'Дуусгах товчийг дарахаа мартсан байна',
    dontKnowTheTask: 'Даалгавраа мэдэхгүй байсан',
    notResponsibleForTask: 'Энэ даалгаврыг хариуцаагүй',
    otherReason: 'Бусад шалтгаан',
    writeOtherReason: 'Бусад шалтгааныг оруулна уу',
    createdNewPrivateChat: 'Шинэ хувийн чат үүсгэгдлээ',
    loginError: 'Алдаа гарсан тул таны нэвтрэх оролдлого амжилтгүй боллоо',
    leaveGroup: 'Группээс гарах',
    atleastOneAdminIsRequired: 'Та группийн админ тул группээс гарах боломжгүй. <br>Админ эрхийг өөр гишүүнд шилжүүлсэний дараа ахин оролдоно уу',
    confirmToLeaveBoard: '<strong>{title}</strong> группээс гарахдаа итгэлтэй байна уу?',
    leftOneMember: '<strong>{userList}</strong> группээс гарлаа',
    leftMultipleMembers: '<strong>{userList}</strong> нар группээс гарлаа',
    list: 'Жагсаалт',
    jumpToMessage: 'Мэссеж рүү очих',
    searchInOneChat: '<strong>"{title}"</strong> &nbsp;чатад хайх',
    searchInAllChat: 'Бүх чатад хайх',
    copied: 'Хуулагдсан',
    selectText: 'Текст сонгох',
    noTextSelected: 'Текст сонгогдоогүй байна',
    failedToUploadFile: 'Файл байршуулахад алдаа гарлаа',
    resend: 'Илгээх',
    failedToSendMessage: 'Мэссеж илгээхэд алдаа гарлаа',
    takeAction: 'Арга хэмжээ авна уу',
    caseExists: 'байна',
    uploadQR: 'Файл',
    forward: 'Дамжуулах',
    selectTextToQuot: 'Дамжуулах текст сонгох',
    theme: 'Харанхуй горим',
    lightTheme: 'Идэвхгүй',
    darkTheme: 'Идэвхтэй',
    allMemberMention: 'Бүх гишүүдэд',
    deletePrivateChat: 'Чатыг устгах',
    deleteGroupChat: 'Группийг устгах',
    groupMembers: 'Группийн гишүүд',
    inviteMembers: 'Гишүүн урих',
    confirmToAction: 'Тийм',
    cancelToAction: 'Үгүй',
    deleteTask: 'Даалгаврыг устгах',
    editMessage: 'Мессежийг засах',
    quotMessage: 'Мессежээс эш татах',
    deleteMessage: 'Мессежийг устгах',
    replyMessage: 'Мессежд хариулах',
    copyMessage: 'Мессежийг хуулах',
    shareMessage: 'Мэссежийг хуваалцах',
    toTask: 'Даалгавар',
    toNote: 'Тэмдэглэл',
    toChat: 'Чат',
    YouCanChangeItLater: '(Дараа өөрчилж болно)',
    titleAuth: 'Бүртгэл',
    titleBoard: 'Чат',
    titleMembers: 'Гишүүд',
    notPhoneNumber: 'Ийм утасны дугаар байхгүй байна',
    changeLogin: 'Нэвтрэх мэйл хаяг солих',
    waitingForResponse: 'Хариу хүлээж байна',
    friendRequests: 'Гишүүний хүсэлт',
    verified: 'Баталгаажсан',
    acceptPartnerRequest: 'Батлах',
    denyDenyPartnerRequest: 'Татгалзах',
    notverified: 'Баталгаажаагүй',
    blockUser: 'Блоклох',
    unBlockUser: 'Блокоос гаргах',
    signStamp: 'Энд гарын үсэг зурах',
    signRequestSuccessful: 'Гарын үсгийн хүсэлт амжилттай илгээгдлээ',
    alreadyBlocked: 'Өмнө нь блоклогдсон байна',
    blockSuccess: 'Хэрэглэгчийг блокллоо',
    unBlockSuccess: 'Хэрэглэгчийг блокоос гаргалаа',
    blockList: 'Блоклсон хэрэглэгчид',
    qrGeneratedSuccessfully: 'QR код шинээр үүсгэлээ',
    loginVerification: 'Нэвтрэх ID баталгаажуулах',
    userPrivacy: 'Хэрэглэгчийн төлөв',
    userPublic: 'Нээлттэй',
    userPrivate: 'Хаалттай',
    userPublicInfo: 'Хэрэглэгчийн төлөв нээлттэй үед бүх хэрэглэгчид таныг хайх, гишүүнээр нэмэх, мессеж илгээх боломжтой ба таны профайл системд нээлттэй байх болно' ,
    userPrivateInfo: 'Хэрэглэгчийн төлөв хаалттай үед зөвхөн таны QR кодийг уншуулсан эсвэл нэг групп чат-д байгаа хэрэглэгчид танийг гишүүнээр нэмэх мессеж илгээх эрхтэй байна.Хаалттай горимд таны профайл хуудас нийтэд нээлттэй байна, Гэхдээ утасны дугаар, имэйл, танилцуулга гэх мэт мэдээлэл зөвхөн таны бүртгэлтэй гишүүдэд харагдана',
    cancelPartnerRequest: 'Хүсэлтийг цуцлах',
    correspondMayMiss: 'Харилцагч таны гишүүний хүсэлтийг хүлээн авах хүртэл таны мессежийг уншихгүй байх боломжтой',
    cancelSignature: 'Цуцлах',
    canbeDone: 'Гарын үсэг зурагдаагүй байна',
    resetSignature: 'Арилгах',
    newMessage: '{count} шинэ мессеж',
    newMessages: '{count} шинэ мессежнүүд',
    newRequest: '{count} шинэ хүсэлт',
    newRequests: '{count} шинэ хүсэлтнүүд',
    tryAgain: '30 минутын дараа дахин оролдоно уу',
    signBelow: 'Гарын үсгээ энд зурна уу',
    myChat: 'My Chat',
    dragSign: 'Та гарын үсгээ хүссэн газар руугаа мөн томруулах боломжтой',
    finishSignature: 'Гарын үсэг зурж дууссанаар дахин зурах болон өөрчлөх боломжгүй. Та дуусгахдаа итгэлтэй байна уу?',
    jumpToTerms: 'Үйлчилгээний нөхцөл',
    unableToSendMessageDueBlockAction: 'Message delivery to this user is currently unavailable',
    setTime: 'Цаг тааруулах',
    expiredTaskWarning: 'Танд хугацаа хэтэрсэн {number} даалгавар байна',
    signatureRequestWarning: 'Танд гарын үсэг зурах {number} бичиг баримт байна',
    signed: 'Зурсан',
    unsigned: 'Зураагүй',
    currentlyNoUser: 'Одоогоор гишүүн алга',
    forgotPassword: 'Нууц үг солих',
    passwordConfirmation: 'Нууц үг баталгаажуулах',
    updatePassword: 'Нууц үг солих',
    registerButton: 'Бүртгүүлэх',
    loginTitle: 'Нэвтрэх',
    registerTitle: 'Бүртгүүлэх',
    resetPasswordTitle: 'Нууц үг солих',
    backToLogin: 'Нэвтрэх хэсэг рүү буцах',
    registerWithEmail: 'Мэйл хаягаар бүртгүүлэх',
    registerWithPhone: 'Утасны дугаараар бүртгүүлэх',
    resetWithEmail: 'Мэйл хаяг руу илгээх',
    resetwithPhone: 'Утасны дугаар руу илгээх',
    saveSignature: 'Та гарын үсгээ миний гарын үсэг болгон хадгалахыг хүсэж байна уу?<br>Та гарын үсэг зурахыг хүссэн аливаа бичиг баримтанд миний гарын үсгийг ашиглаж болно',
    inviteMessage: '{name} is inviting you to Glowd',
    userYourSign: 'Та миний гарын үсгийг ашиглахыг хүсч байна уу?',
    tooManyAttemptError: {        
        loginAction: 'Хэт олон оролдлого, хэсэг хугацааны дараа дахин оролдоно уу',
        otpSendAction: 'Хэт олон код хүссэн тул хэсэг хугацааны дараа дахин оролдоно уу',
        otpCheckAction: 'Хэт олон удаа кодоо буруу хийсэн тул хэсэг хугацааны дараа дахин оролдоно уу',
        mailOrPhoneRegisterCheck: 'Хэт олон оролдлого, хэсэг хугацааны дараа дахин оролдоно уу',
    },
    reacted: 'Реакт үзүүлсэн гишүүд',
    loginEmailorPhone: 'Мэйл хаяг эсвэл утасны дугаар',
    lastActivity: 'Сүүлд шинэчлэгдсэн',
    untilDeletion: '0 өдрийн дараа устгагдана | 1 өдрийн дараа устгагдана | {count} өдрийн дараа устгагдана',
    chatDeleteBy: 'Хэрэв <a href="/support/docs/mn/terms-of-service#data-handling">Үйлчилгээний нөхцөл</a>д заагдсан арга хэмжээ авахгүй бол энэ чат {date}-д устгагдах болно',
    signedMembers: 'Гарын үсэг зурсан гишүүд',
    unsignedMembers: 'Гарын үсэг зураагүй гишүүд',
    checkedMembers: 'Баталсан гишүүд',
    uncheckedMembers: 'Батлаагүй гишүүд',
    orSocial: 'Эсвэл',
    privateAccount: 'Хаалттай аккаунт',
    suspendedChat: 'Энэ чат {date}-д устгагдана',
    fileExpired: 'Файл устгагдсан',
    fileExpireDate: 'Өнөөдөр устгагдана | Маргааш устгагдана | Устгагдах хүртэл {days} өдөр',
    erased: 'Устгагдсан',
    cancelJoinRequest: 'Хүсэлтийг цуцлах',
    alreadyJoinedGroupChat: 'Аль хэдийн гишүүнээр элссэн байна.',
    noMembersYet: 'Одоогоор гишүүн алга байна',
    introduceMember: '<strong>{name}</strong>-г бусдад танилцуулах',
    urlIntroduceExplaination: 'QR кодоор',
    QrIntroduceExplaination: 'URL хаягаар',
    messageLimitAlert: 'Мэссежийн дээд хэмжээ 5000 тэмдэгт',
    typeToSearchTags: 'Таг хайхын тулд түлхүүр үг оруулна уу',
    noBlockUserYet: 'Одоогоор блок хийсэн хэрэглэгч байхгүй байна',
    profileUpdated: 'Амжилттай хадгаллаа',
    cancelSave: 'Цуцлах',
    help: {
        helpTitle: 'Тусламж',
        AccountManagement: 'Хэрэглэгчийн бүртгэл',
        ChatGuide: 'Чатын талаар',
        MemberGuide: 'Гишүүд',
        Other: 'Бусад',
        needHelp: 'Тусламж',
        titleHelp: 'Тусламж',
        ReportProblem: 'Асуудал мэдэгдэх',
        reportEmail: 'Имэйл хаяг',
        reportTitle: 'Гарчиг',
        reportDescription: 'Тайлбар',
        reportFile: 'Файл байршуулах',
        maximumFileSizeIsHundred: 'Файлийн дээд хэмжээ 100Мб',
        maximumFileIsThree: 'Ихдээ 3 файл байршуулах боломжтой',
        reportSentSuccessfully: 'Амжилттай илгээлээ',
        searchPlaceHolder: 'Тусламжаас хайх',
        TaskGuide: 'Даалгавар',
        accountManagementContents: [            
            {
                title: 'Шинээр бүртгүүлэх',
                steps: [
                        '<a href="/auth">Бүртгэлийн хуудас</a>руу очно.', 
                        '<strong>Бүртгүүлэх</strong> товч дээр дарна.', 
                        'Имэйл хаягаа оруулна.',
                        'Имэйл хаягаа шалгаж, системээс илгээсэн нэг удаагийн кодийг оруулна.',
                        'Нэр болон нууц үг тохируулна.'
                    ]
            },
            {
                title: 'Нууц үг сэргээх',
                steps: [
                        `Үндсэн цэс ${app_icons.hamburg_icon} товч дээр дарна.`, 
                        `<strong>Аккаунт тохиргоо</strong>г сонгоно.`, 
                        '<strong> Нууц үг солих</strong> сонголтыг сонгоно.'
                    ]
            },
            {
                title: 'Бүртгэл устгах',
                steps: [
                        `Үндсэн цэс ${app_icons.hamburg_icon} товч дээр дарна.`, 
                        '<strong>Аккаунт тохиргоо</strong>г сонгоно.', 
                        '<strong>Аккаунт устгах</strong> сонголтыг сонгоно.'
                    ]
            }
            
        ],
        chatGuide: [            
            {
                title: 'Шинэ чат үүсгэх',
                steps: [
                        '<a href="/chat">Чат</a> хуудас уу очно.', 
                        `Доод хэсэгт байрлах ${app_icons.add_icon} товч дээр дарна.`, 
                        `Чатын төрлийг сонгоно. Групп чат эсвэл Хувийн чат<br><br>
                        <strong>Групп чат</strong>:<br><br>

                        ・Групп чат үүсгэхдээ эхлээд нэг эсвэл түүнээс дээш гишүүдийг сонгоно.<br>
                        ・Чатыг үүсгэгч нь чатын админаар сонгогдоно. Админ нь чатын гишүүдийг хянах, чатын тохиргоог өөрчлөх боломжтой байна.<br>
                        ・Чатын нэрийг оруулна. Чатын нэрийг дараа нь өөрчилж болно.<br>
                        ・Групп чатын админ нь чатын тохиргоог өөрчлөх, гишүүд хасах, чатыг устгах эрхтэй байна.<br>
                        ・Харин бусад гишүүдийн хувьд дээрх эрх хаалттай байх боловч группт гишүүн урих боломжтой.<br>
                        ・Хэрэв та групп чатын гишүүн байх шаардлагагүй гэж үзвэл чатаас өөрийн хүслээр гарах боломжтой.<br><br>
                        <strong>Хувийн чат</strong>:<br><br>

                        Хувийн чат нь 2 хэрэглэгчийн хоорондох чат тул нэг л хэрэглэгчийг сонгоно.<br>
                        Чатыг үүсгэсэний дараа гишүүн нэмэх, хасах боломжгүй.<br>
                        Хувийн чатыг 2 хэрэглэгчийн аль нь ч устгах боломжтой. Гэвч энэ үйлдэл нь зөвхөн устгасан хэрэглэгчид хүчинтэй. <br>
                        Өөрөөр хэлбэл хэрэв та хувийн чатыг устгасан ч нөгөө хэрэглэгчид чат болон мессежүүд устгагдалгүй үлдэх юм.<br>
                        Эдгээр ялгаануудыг ойлгосоны үндсэн дээр та өөрт тохирох чатын төрлийг сонгон үүсгээрэй.<br>
                        `,

                        'Чатын гишүүдийг сонгоно.',
                        'Хэрэв "Групп Чат"-ыг сонгосон бол чатын нэр болон зургийг(сонголтоор) оруулна.'
                    ]
            },
            {
                title: 'Групп чатад гишүүн нэмэх',
                steps: [
                        `Чатын нэрний ард байрлах ${app_icons.kebab_icon} цэс товч дээр дарна.`, 
                        '<strong>Гишүүн урих</strong> сонголтыг сонгоно.', 
                        `Группт гишүүн нэмэх үндсэн 3 арга байдаг: <br> <br>
                        <strong>QR код</strong>: Хэрэв урих хэрэглэгч тантай ойр байвал группийн QR кодийг тухайн хэрэглэгчийн төхөөрөмжөөр уншуулах<br>
                        <strong>URL</strong>: Эсвэл урилгын тусгай URL хаягийг урих хэрэглэгчид илгээх.<br>
                        <strong>Шууд нэмэх:</strong> Та <strong>Миний Гишүүд</strong>эд нэмсэн хэрэглэгчдийг групп чатад шууд нэмэх боломжтой.<br><br>
                        Санамж:<br>

                        ・Хэдий гишүүдийг шууд нэмэх аргаар нэмсэн ч тухайн хэрэглэгч нь групп чатад нэгдэхийг зөвшөөрсний дараа группийн гишүүн болно. <br>
                        Урилга хүлээн авсан хэрэглэгч "Зөвшөөрөх" товчийг дарах хүртэл чатын мессежүүд болон бусад үйл явдалыг харж чадахгүй.<br>
                        ・Хэрэв хэрэглэгч QR код эсвэл URL хаяг ашиглан групп чатад нэгдэх хүсэлт илгээвэл одоогийн гишүүдээс багадаа нэг гишүүн баталгаажуулна. `
                    ]
            },
            {
                title: 'Групп чатын гишүүдийг хянах',
                steps: [
                        `${app_icons.kebab_icon} цэс товч эсвэл гишүүдийн зураг дээр дарна.`, 
                        `Гарч ирэх цонхноос бүх гишүүдийн жагсаалтыг тэдний төлөвийн хамт харах боломжтой. Гишүүдийн 4 төлөв байдаг: <br><br>
                        <strong>Админ</strong>: Групп чатыг устгах, тохиргоог өөрчлөх, гишүүд хасах эрх бүхий гишүүд.<br>
                        <strong>Гишүүд</strong>: Одоогоор идэвхтэй байгаа бусад гишүүд.<br>
                        <strong>Хүлээгдэж буй</strong>: Группт шууд нэмэх аргаар нэмэгдсэн, зөвшөөрөл хүлээж байгаа гишүүд.<br>
                        <strong>Хүсэлт гаргасан</strong>: QR код эсвэл URL хаяг ашиглан группт нэгдэх хүсэлт гаргасан гишүүд.
                        `, 
                    ]
            },
            {
                title: 'Дурдах /Меншон/',
                description: `Мессеж илгээхдээ нэг ,олон эсвэл групп чатын бүх гишүүдийг дурдаж болно. 
                Мессеж бичих явцдаа <strong>'@'</strong> тэмдэгтийг бичвэл гишүүдийн сонголт бүхий цонх гарч ирнэ. 
                <br>Дурдагдсан гишүүд имэйлээр мэдэгдэл хүлээн авах болно.`,
                steps:[
                    
                ]
            },
            {
                title: 'Баталгаажуулах хүсэлт',
                description:  'Мессеж илгээсний дараа Баталгаажуулах хүсэлт илгээх боломжтой. Энэ функц нь таны илгээсэн мессежийг сайтар уншиж танилцсан гэдгийг илэрхийлэх зориулалттай. <br>Дараах алхамын дагуу баталгаажуулах хүсэлт илгээгээрэй:<br>',
                steps:[
                    `Мессежийн баруун дээр байрлах ${app_icons.kebab_icon} товч дээр дарна.`, 
                    `Гарч ирэх цэснээс <strong>Баталгаажуулах хүсэлт илгээх</strong> сонголтыг сонгоно. <br><br> 
                    Группийн гишүүдээс таны мессежийг уншиж танилцах гишүүдийг сонгоно. Сонгогдсон гишүүд имэйлээр мэдэгдэл хүлээн авах болно.
                    <br>
                    Баталгаажуулах хүсэлт хүлээн авсан гишүүд таны мессежийн зүүн доор байрлах ✔ товч дээр дарж мессежийг хүлээн авч сайтар уншиж танилцсан гэдгээ илэрхийлэх юм. <br>Та Баталгаажуулсан болон хараахан баталгаажуулаагүй гишүүдийн нэрсийг харах боломжтой.
                    <br>
                    Таны чухал мессежийг зохих гишүүдэд хүргэхэд туслах функц юм.`
                ]
            },
            {
                title: 'Файл илгээх',
                description: `Та чат дотор хэрэгцээт файлаа бусадтай хуваалцаж болно.<br> Файл илгээхдээ дараах алхамуудыг дагаарай:`,
                steps: [
                    'Файл ихдээ 100МБ хэмжтээтэй байна.',
                    'Мэссежийн текстээ бичнэ.',
                    `Мэссеж бичих хэсгийн зүүн талд байрлах ${app_icons.file_icon} товч дээр дарна.`,
                    'Та өөрийн төхөөрөмж дээр байрлаж буй илгээх файлаа сонгоно',
                    `Сонгогдсон файл мессежэд хавсаргагдана.
                    <br><br>
                    <strong>Санамж</strong>: Мэссежэд хавсаргасан файл байршуулсан өдрөөс хойш 90 хоног байрших болно. 91 дэхь хоног дээр файл бүр мөсөн устана.
                    <br>Иймээс чухал файлаа төхөөрөмж дээрээ хадгалахыг санал болгож байна.
                    <br>
                    `
                ]
            },
            {
                title: 'Гарын үсгийн хүсэлт',
                description: `PDF өргөтгөлтэй файл дээр та группийн гишүүдээр гарын үсэг зуруулж авах боломжтой. <br>Гарын үсгийн хүсэлт илгээхийн тулд:`,
                steps: [
                    'Мэссежээ бичиж гарын үсэг зуруулах PDF файлаа хавсаргана.',
                    'Мэссежээ илгээсний дараа PDF файл дээр дарж нээнэ.',
                    `Баруун дээр байрлах ${app_icons.kebab_icon} товч дээр дарна.`,
                    'Гарч ирэх цэснээс <strong>Гарын үсгийн хүсэлт</strong> сонголтыг сонгоно.',
                    'Дараа нь гарын үсэг зуруулах гишүүдийг сонгоно.',
                    `Сонгогдсон гишүүд гарын үсэг зурах хүсэлтийн талаар мэдэгдэл хүлээн авах болно.
                    <br><br>
                    Гарын үсгийн хүсэлттэй холбоотойгоор дараах зүйлсийг анхаарна уу:<br><br>
                    ・Гарын үсэг зурах хүсэлт хүлээн авсан гишүүн хэрэглэж буй төхөөрөмжөөсөө хамаарч хуруу эсвэл хулгана ашиглан гарын үсэг зурах болно.<br><br>
                    ・Энэ нь тухайн улс орны хууль тогтоомж эсвэл компаний бодлого, дүрэм журмын дагуу албан ёсны гарын үсгийг орлох боломжгүй байх магадлалтай.<br>
                    Иймээс энэ функцийг ашиглахын өмнө хууль дүрмийг нягталж, хоёр тал зөвшөөрсний үндсэн дээр ашиглахыг зөвлөж байна.<br>
                    Энэ функц нь гарын үсэг зуруулах ажлыг хөнгөвчлөх зориулалттай
                    `
                ]
            }
            
        ],
        memberGuide:[
            {
                title: 'Хүмүүстэй холбогдох',
                description: `Манай систэмд бусад хүмүүстэй холбогдох хялбар байх болно. Танд хэрэг болох аргуудыг танилцуулъя:<br><br>
                ・ Хэрэв таны хайж буй хэрэглэгч Нээлттэй тохиргоотой бол Гишүүд хуудас руу очиж хайх хэсэгт хайж, холбогдох боломжтой.
                <br><br>
                ・ Харин таны хайж буй хэрэглэгч Хаалттай тохиргоотой байвал та тухайн хэрэглэгчтэй шууд холбогдох боломжгүй.
                
                Хаалттай тохиргоо бүхий хэрэглэгчтэй холбогдох арга зам:
                <br><br>
                <strong>Урилгын тусгай URL эсвэл QR код</strong>: Хэрэв тухайн хэрэглэгч нь тантай урилгын тусгай URL эсвэл QR кодоо хуваалцсан бол та тэдгээрийг ашиглан холбогдох хүсэлт илгээж болно.
                <br><br>
                <strong>Групп чатын гишүүнчлэл</strong>: Хэрэв таны хайж буй хэрэглэгч тантай нэг групп чатын гишүүд байх юм бол тухайн хэрэглэгч хаалттай эсэхээс үл хамааран шууд холбогдох боломжтой байх болно. 
                
                `
                
            },
            {
                title: 'Блок',
                description: `<br>Блоклох нь таныг хүсээгүй гишүүний хүсэлт, мессеж зэргээс сэргийлэхэд тусална. 
                Блоклогдсон хэрэглэгч нь тан руу гишүүний хүсэлт, хувийн чатын хүсэлт зэргийг илгээх боломжгүй байна.
                <br><br><strong>Хэрхэн блок хийх вэ?</strong>:<br><br>
                ・Блоклох хэрэглэгчийг хайж олно. Хувийн чат, гишүүдийн жагсаалт гэх мэт.
                <br>
                ・Хэрэглэгчийн хуудас руу орж профайл зургийн доор байрлах "Блок" довч дээр дарна.
                <br>
                ・Блоклох үйл явц дуусна.
                <br>
                <br><br>
                <strong>Блоклох нь</strong>:
                <br><br>
                ・Тухайн хэрэглэгч нь тантай шууд холбогдох боломжгүй болно.
                <br>
                ・Гэсэн хэдийн ч тухай хэрэглэгчийн өмнөх мессежүүд болон бусад бичлэгүүд танд харагдсан хэвээр байна.
                <br>
                ・Блоклох нь хүсээгүй мессеж болон бусад хүсэлтээс сэргийлнэ.
                <br>
                ・Хэрэглэгчийг блоклох нь групп чат дотор хүчингүй байх болно.
                <br><br>
                <strong>Блоклсон хэрэглэгчдийг харах</strong>:
                <br><br>
                Хэрэв та блоклосон хэрэглэгчийг блокоос гаргахыг хүсвэл.<br>
                ・Дэлгэцийн зүүн дээр байрлах ${app_icons.hamburg_icon} товч дээр дарна.
                <br>
                ・<strong> Аккаунт тохиргоо</strong>г сонгоно.<br>
                ・Гарч ирэх цонхноос<strong> Блоклосон хэрэглэгчид</strong> сонголтыг сонгоно. <br>
                ・Блоклосон хэрэглэгчид дундаас блокоос гаргах хэрэглэгчийг сонгож "Блокоос гаргах" товчийг дарна.
                <br>
                ・Блоклох үйлдлийг зөвхөн шаардлагатай гэж үзсэн тохиолдолд хэрэглэгч та өөрийн шийдвэрээр хэрэглэхийг зөвлөж байна.
                `
            }
        ],
        taskGuide:[
            {
                title: 'Даалгавар',
                description: `Та чат дотор даалгавар үүсгэж түүнийгээ хянах боломжтой. <br>Даалгавар хэсэг нь <strong>Календар</strong> болон <strong>Жагсаалт</strong> гэсэн хоёр харагдацтай. 
                Даалгавар нь групп чат болон хувийн чат аль алинд нь ашиглах боломжтой.
                <br><br><strong>Даалгаврын харагдац</strong>:<br><br>

                <strong>Календар</strong>: Календар хэлбэрт тухайн сар, долоо хоног өдөрт ямар даалгавар байгааг хялбараар харах боломжтой.
                <br><br>
                <strong>Жагсаалт</strong>: Цаг хугацааны дарааллаар бүх даалгаварыг жагсаалт хэлбэрээр харах сонголт. <br>
                Харагдацийг солихийн тулд та ${app_icons.calendar_icon} эсвэл ${app_icons.list_icon} товч дээр дарна уу.`
            },
            {
                title: 'Даалгавар үүсгэх',
                steps: [
                    'Даалгавар үүсгэхийг хүссэн чатыг нээнэ.',
                    'Хувийн эсвэл групп чат аль нь ч байсан болно.',
                    'Даалгавар хэсэгт шилжинэ.',
                    `${app_icons.task_icon} товч дээр дарж Даалгаврын хэсэгт нэвтрээрэй.`,
                    `Даалгавар хэсэг дотор ${app_icons.add_icon} товчийг дарна.`,
                    `Шинэ даалгавар үүсгэх цонх нээгдэх болно`,
                    `Даалгавар үүсгэхэд шаардлагатай талбаруудыг бөглөнө:<br><br>

                    <strong>Гарчиг</strong>: Даалгаврын гарчгийг оруулна.<br>
                    <strong>Гишүүд</strong>: Даалгаврыг гүйцэтгэх гишүүдийг сонгоно.<br>
                    <strong>Тэмдэглэл</strong>: Тухайн даалгавартай холбоотой нэмэлт дэлгэрэнгүй.<br>
                    <strong>Эцсийн хугацаа</strong>: Дуусгах ёстой огноо.`,
                    `Шаардлагатай мэдээллийг оруулсны дараа хадгалах товчийг дарна.`
                
                ]
            },
            {
                title: 'Даалгаврын үйл явц, гүйцэтгэл',
                description: `・Даалгаврын бүх гишүүд даалгаврыг засах эрхтэй байна.<br>

                ・Даалгаврын гишүүд хугацаандаа даалгавраа дуусгаж чадаагүй тохиолдолд яагаад хугацаандаа дуусгаж чадаагүй талаарх анкетийг бөглөх шаардлагатай. Энэ үйл явц нь хугацаа хэтэрсэн даалгаврыг дуусгах үед явагдана.`
            },
            {
                title: 'Даалгаврыг дуусгах',
                description: `・Даалгавраа хийж дууссан гэж үзвэл "Дуусгах" товчийг дарна.<br>

                `
            }
        ]
        
    }
}
export default mn