Сайн байна уу.

Манай үйлчилгээг сонгон үйлчлүүлж байгаад баярлалаа.

Бид дараах агуулга бүхий асуудлын мэдэгдлийг хүлээн авлаа.

Дугаар: {{$id}}

Гарчиг:{{$title}}

Агуулга: {{$description}}

Хэрэв шаардлагатай бол бид тантай эргэн холбоо барих болно.

Хүндрэл учруулсанд хүлцэл өчье.

Уг имэйлд хариу бичих шаардлагагүй.

Хэрэв уг имэйл танд хамааралгүй бол имэйлийг устгана уу.

----------------------------------------------------- 
Glowd
{{url('')}}
-----------------------------------------------------

