@extends('layouts.app')
@section('title', 'CLAP - プライバシーポリシー')
@section('content')

<div style="color:var(--primary-color);background-color:var(--background-color);padding: 3em;">

<h1 style="font-size: 24px;">【プライバシーポリシー】</h1>
<br>
<p style="line-height:2;">
グラウド株式会社(以下、「当社」)は、当社の提供するGlowd(以下、「本サービス」)の利用者(以下、「利用者」)の個人情報を適切に取り扱うこと、保護することは事業活動の基本であり、社会的責務であると考えます。 
<br>
利用者に安心して本サービスをご利用いただけるよう、ここに個人情報保護方針を定め、その履行に努めてまいります。
<br>
<br>
基本方針
<br>
<div style="margin-left:30px;line-height:2;">
1.当社は個人情報保護マネジメントシステムを確立し、実施し、継続的にこれを維持し、定期的な改善に努めます。
<br>
2.当社は上記で確立した個人情報保護マネジメントシステムについて、役員および全ての業務従事者に対してその取り組みを周知し、全社一帯となってその遵守に努めます。
<br>
3.当社はお預かりした個人情報につきまして、本人に明示し同意を得た利用の範囲内において適切に取扱い、管理をいたします。また、利用者本人の同意、もしくはこれを行わない場合に生命の危機や法に触れるなどの正当な理由がある場合を除いては、個人情報の第三者への開示および提供をいたしません。
<br>
4.当社は個人情報保護マネジメントシステムの確立に伴い、個人情報の取扱いに関する法令、国が定める指針、その他の規範を遵守いたします。
<br>
5.当社は個人情報の漏えい、滅失又はき損等個人情報についてのリスクを常に認識しその防止と是正に努めます。
<br>
6.当社の個人情報の取扱い及び個人情報保護マネジメントシステムについての苦情及び相談、お問合せなどは以下の窓口にて承ります。
窓口：グラウド株式会社 Glowd サポートチーム
E-mail：〇〇〇〇@glowd.app
<br>
</div>
<br>
個人情報の利用目的について
<br>
<br>
当社における個人情報の利用目的は以下の通りとなります。当社は、当該目的を超えて個人情報を利用しないものとします。
<br>
<br>
万一、以下の目的以外での利用の必要が生じた際には、改めて利用者へ通知し、又は利用者の同意を得るものします。
<br>
    <div style="margin-left: 30px;line-height:2;">
    (a)利用者の個人認証
    <br>
    (b)利用者による本サービスの利用とそれに付随する連絡
    <br>
    (c)その他本サービスの運営（通知配信に限らず、当社から利用者に対して、あらゆる情報を提供することを含みます）
    <br>
    (d)当社が利用者にとって有益だと判断する当社のサービス（本サービスに限りません）又は、広告主や提携先企業の商品、サービス等に関する情報の提供並びに当社によるマーケティング等の実施
    <br>
    (e)本サービスの品質管理のためのアンケート調査及び当該結果の分析
    <br>
    (f)利用者に対する、本サービス運営に著しく影響を及ぼす事項（本サービス内容の大幅な変更、一時停止を含みますがこれらに限られません）に関する連絡
    <br>
    (g)利用者から個人情報の取扱いに関する同意を求めるための連絡
    <br>
    </div>
<br>
ソーシャルログインについて
<br>
<br>
本サービスのソーシャルログインは以下のソーシャルログイン対象SNSで利用可能です。
    <br>
    <div style="margin-left: 30px;line-height:2;">
    (a)Facebookアカウント
    <br>
    (b)Googleアカウント
    <br>
    (c)Twitterアカウント
    <br>
    </div>
    <br>
    Facebookアカウントログインについて
<br>
<br>
Facebookアカウントを使用して本サービスへログインすると、Facebookは利用者アカウントの特定の情報を本サービスと共有する許可を求めます。
<br>
<br>
これには、ID、氏名、メールアドレス、プロフィール写真が含まれます。この情報はFacebookによって収集され、Facebookのプライバシーポリシーの条件に基づいて提供されます。 
<br>
<br>
本サービスではFacebookから共有された、ID、氏名、メールアドレス、プロフィール写真を本サービスのログイン情報、及び、ログイン後の利用者情報として使用します。
<br>
<br>
Facebookのプライバシー設定を使用して、Facebookから受け取る情報を制御することがきます。

</p>
</div>
@endsection