@extends('layouts.app')
@section('title', 'CLAP - Нууцлалын бодлого')
@section('content')

<div style="color:var(--primary-color);background-color:var(--background-color);padding: 3em;">

<h1 style="font-size: 24px;">Нууцлалын бодлого</h1>
<br>
<p style="line-height:2;">
Glowd Co., Ltd (цаашид "манай компани" гэх) нь Glowd хэрэглэгчдийн (цаашид "хэрэглэгч" гэх) бидэнд өгсөн (цаашид "үйлчилгээ" гэх) хувийн мэдээлэлтэй зөв харьцаж, хамгаалах зорилготой, бидний бизнесийн үйл ажиллагааны нэг хэсэг болгон. Үүнийг бид бизнесийнхээ үндэс суурь, нийгмийн хариуцлага гэж үздэг.
<br>
Бид хувийн мэдээллийг хамгаалах бодлогыг бий болгосон бөгөөд хэрэглэгчид энэ үйлчилгээг итгэлтэйгээр ашиглахын тулд үүнийг хэрэгжүүлэхийн тулд бүх хүчин чармайлтаа гаргах болно.
<br>
<br>
Үндсэн бодлого
<br>
<div style="margin-left:30px;line-height:2;">
1.Бид хувийн мэдээллийг хамгаалах удирдлагын тогтолцоог бий болгож, хэрэгжүүлж, түүнийг тасралтгүй хадгалж, тогтмол сайжруулж ажиллах болно.
<br>
2.Дээрх бий болгосон хувийн мэдээллийг хамгаалах удирдлагын тогтолцооны тухайд бид өөрсдийн хүчин чармайлтаа албан тушаалтнууд болон нийт ажилтнууддаа мэдээлж, бүхэл бүтэн компанийн хувьд дагаж мөрдөхийг хичээх болно.
<br>
3. Бид тухайн хүнд тодорхой зааж, зөвшөөрлийг нь авсан ашиглалтын хүрээнд бидэнд итгэмжлэгдсэн хувийн мэдээллийг зохих ёсоор зохицуулж, удирдана. Нэмж дурдахад, бид хэрэглэгчдийн зөвшөөрөл, амьдралын хямрал, хууль зөрчсөн гэх мэт үндэслэлтэй шалтгаан байхгүй бол бид хувийн мэдээллийг гуравдагч этгээдэд задруулахгүй, өгөхгүй. .
<br>
4.Хувийн мэдээллийг хамгаалах удирдлагын тогтолцоог бий болгосноор хувийн мэдээлэлтэй харьцахтай холбоотой хууль тогтоомж, Засгийн газраас тогтоосон заавар, бусад хэм хэмжээг дагаж мөрдөнө.
<br>
5. Бид хувийн мэдээлэл алдагдсан, алдагдсан, гэмтэх зэрэг хувийн мэдээлэлтэй холбоотой эрсдэлүүдийг үргэлж мэдэж, урьдчилан сэргийлэх, залруулахыг хичээдэг.
<br>
6.Манай компанийн хувийн мэдээлэлтэй харьцах, хувийн мэдээлэл хамгаалах удирдлагын тогтолцоотой холбоотой гомдол, зөвлөгөө, лавлагаа зэргийг доорх хаягаар хүлээн авч байна.
<br>
</div>
<br>
Хувийн мэдээллийг ашиглах зорилго
<br>
<br>
Манай компанид хувийн мэдээллийг ашиглах зорилго нь дараах байдалтай байна. Манай компани хувийн мэдээллийг зориулалтын дагуу ашиглахгүй.
<br>
<br>
Доор дурдсанаас өөр зорилгоор мэдээллийг ашиглах шаардлагагүй тохиолдолд бид хэрэглэгчдэд дахин мэдэгдэх эсвэл хэрэглэгчийн зөвшөөрлийг авна.
<br>
    <div style="margin-left: 30px;line-height:2;">
    (a) Хэрэглэгчийн хувийн баталгаажуулалт
    <br>
    (б) Хэрэглэгчид үйлчилгээ болон холбогдох харилцаа холбоог ашиглах
    <br>
    (в) Энэхүү үйлчилгээний бусад үйл ажиллагаа (мэдэгдэл хүргэхээр хязгаарлагдахгүй, үүнд манай компаниас хэрэглэгчдэд бүх төрлийн мэдээлэл өгөх)
    <br>
    (г) Хэрэглэгчдэд ашигтай гэж үзсэн манай үйлчилгээ (энэ үйлчилгээгээр хязгаарлагдахгүй), сурталчлагч болон түнш компаниудын бүтээгдэхүүн, үйлчилгээ, манай компанийн маркетингийн хэрэгжилт гэх мэт мэдээллээр хангах
    <br>
    (д) Энэхүү үйлчилгээний чанарын хяналтад зориулсан санал асуулга, үр дүнд дүн шинжилгээ хийх
    <br>
    (е) Энэ үйлчилгээний үйл ажиллагаанд ихээхэн нөлөөлж буй асуудлын талаар хэрэглэгчдэд мэдэгдэх (энэ үйлчилгээг түр зогсоох, томоохон өөрчлөлт оруулах, гэхдээ үүгээр хязгаарлагдахгүй)
    <br>
    (ё) Хувийн мэдээлэлтэй харьцах талаар хэрэглэгчээс зөвшөөрөл хүссэн холбоо барих хаяг
    <br>
    </div>
<br>
Сошиал нэвтрэх тухай
<br>
<br>
Энэ үйлчилгээний сошиал нэвтрэлтийг дараах сошиал нэвтрэх зорилтот SNS ашиглан ашиглаж болно.
    <br>
    <div style="margin-left: 30px;line-height:2;">(a)Facebook
    <br>
    (b)Google
    <br>
    (c)Twitter
    <br>
    </div>
    <br>
    Facebook хаягаар нэвтрэх тухай
<br>
<br>
Таныг Facebook хаягаа ашиглан үйлчилгээнд нэвтрэх үед Facebook таны хэрэглэгчийн бүртгэлээс тодорхой мэдээллийг Үйлчилгээтэй хуваалцах зөвшөөрөл хүсэх болно.
<br>
<br>
Үүнд таны ID, нэр, имэйл хаяг, профайл зураг орно. Энэхүү мэдээллийг Facebook цуглуулсан бөгөөд Facebook-ийн Нууцлалын бодлогын дагуу өгдөг.
<br>
<br>
Энэхүү үйлчилгээ нь Facebook-ийн хуваалцсан ID, нэр, цахим шуудангийн хаяг, профайлын зургийг энэ үйлчилгээнд нэвтрэх мэдээлэл болон нэвтэрсний дараа хэрэглэгчийн мэдээлэл болгон ашигладаг.
<br>
<br>
Та Facebook-ээс хүлээн авсан мэдээллээ хянахын тулд Facebook-ийн нууцлалын тохиргоог ашиглаж болно.
</p>
</div>
@endsection