@extends('layouts.app')
@section('title', 'MISO - Бүртгэлийг устгах тухай')
@section('content')
<div style="color:var(--primary-color);background-color:var(--background-color);padding: 3em;">
    <h1 style="font-size: 24px;">Бүртгэлийг устгах тухай</h1>
    <br>
    <div style="line-height:2; margin-left: 10px;">
    Фэйсбүүкийн бодлогын дагуу бид Хэрэглэгчийн өгөгдлийг устгах URL эсвэл Өгөгдөл устгах зааварчилгаа URL хаягийг өгөх ёстой.
    <br>
    Бүртгэлээ устгахын тулд доорх алхмуудыг дагана уу.
            <div style="margin-left:30px;line-height:2;">
            1. Хэрэглэгчийн бүртгэлээрээ нэвтэрнэ үү.
                    <br>
                    2. Нэвтрэн орсны дараа дэлгэцийн зүүн дээд буланд байрлах гамбургер цэсийг товшино уу.
                            <br>
                            3. Профайл хуудас руу шилжихийн тулд өөрийн профайлыг товшино уу.        <br>
                            4. Профайл хуудас руу орсны дараа дэлгэцийн баруун дээд хэсэгт байрлах kebab цэсийг дарна уу.       <br>
                            5. Бүртгэлийн тохиргооны дэлгэц рүү шилжихийн тулд гарч ирсэн цэснээс "Бүртгэлийн тохиргоо" дээр товшино уу.        <br>
                            6. Гарч ирэх цонхон дээрх "Бүртгэл устгах" дээр дарж хэрэглэгчийн бүртгэлийн мэдээллийг устгаж, бүртгэлийг устгаж дуусгана уу.        <br>
        </div>
    </div>
</div>
@endsection