@extends('layouts.app')
@section('title', 'CLAP - 利用規約')
@section('content')

<div style="color:var(--primary-color);background-color:var(--background-color);padding: 3em;">

<h1 style="font-size: 24px;">利用規約</h1>
<br>
<div style="line-height:2;">
Glowd(以下、「本サービス」)は、グラウド株式会社(以下、「当社」)が提供するクラウド型のビジネスチャットサービスです。
<br>
本規約は、本サービスの利用条件を定めるものであり、本サービスを利用するすべての利用者(以下、「利用者」)に適用されます。
<br>
利用者は、本規約に同意することで、本サービスを利用できるようになります。当社は利用者の了解を得ることなく本規約を変更することがあります。
<br>
利用者による変更内容確認の有無にかかわらず、変更後利用者が本サービスを利用した場合、利用者は本規約の変更に同意したものとします。
<br>
本規約は本サービスを利用する全ての利用者に適用されるものとします。
<br>
<br>
1.アカウント登録
<br>
<div style="margin-left:30px;line-height:2;">
(1)本サービスを利用するには、利用者はアカウント登録が必要です。
<br>
(2)アカウント登録には、メールアドレスまたは携帯電話番号またはソーシャルログインが使用できます。
<br>
(3)利用者は、自己の責任においてアカウント登録を行い、登録情報の正確性・完全性について責任を負います。
<br>
(4)当社は、利用者が本サービスのアカウント登録を完了した時点で、本規約に同意したものとし、本サービスの利用開始日がアカウント登録完了日となります。
<br>
(5)利用開始日は、日本時間を基準とします。
<br>
</div>
<br>
2.パスワード管理
<br>
    <div style="margin-left: 30px;line-height:2;">
    (1)本サービスを利用するにはアカウントのパスワード登録が必要です。
    <br>
    (2)利用者は、自己のアカウントに関連付けられたパスワードを適切に管理する責任があります。パスワードは、第三者に漏洩しないよう適切に保管し、他人に使用させたり、貸与したりすることはできません。
    <br>
    (3)利用者は、ログイン時に入力したパスワードが、利用者本人によって入力されたものとみなされることに同意します。ログイン時にパスワードを入力することにより、契約者本人がサービスを利用しているものとみなされます。
    <br>
    (4)パスワードを忘れた場合、当社が指定する手順に従ってパスワードを再設定することができます。ただし、当社は、本人確認ができない場合や、利用規約に違反していると判断した場合、パスワード再設定を行わないことがあります。
    <br>
    (5)利用者は、定期的にパスワードを変更することを推奨します。
    <br>
    </div>
    <br>
    3.提供サービス
<br>
(1)当社はインターネット上の本サービスを利用者に対しサービス提供するものとし、利用者は、自己の責任および費用において本サービスの利用するために必要な環境(以下、「利用環境」)を準備するものとします。
    <br>
(2)利用環境は以下のものが含まれます。
    <div style="margin-left: 30px;line-height:2;">
    (a)ハードウェア
    <br>
    (b)ソフトウェア
    <br>
    (c)インターネット接続回線
    <br>
    (d)利用環境のセキュリティ確保
    <br>
    (e)その他、本サービスを利用するために必要な環境すべて
    <br>
    </div>
    <br>
4.サービス提供の中断
当社は以下の場合サービス提供を一時中断することがあります。
<br>
<div style="margin-left: 30px;line-height:2;">
(a)システムの保守または更新を行う場合
<br>
(b)火災、停電、天災等の不可抗力により、サービス提供が困難な場合
<br>
(c)セキュリティ上のリスクが生じた場合、または不正アクセス等が発生した場合
<br>
(d)その他、当社が必要と判断した場合
<br>
</div>
<br>
5.禁止事項
<br>
利用者は、本サービスを利用する際に、以下の行為を行ってはいけません。
<br>
<div style="margin-left:30px;line-height:2;">
(a)法令または公序良俗に反する行為
    <br>
    (b)無断で他人の個人情報や機密情報を収集する行為
    <br>
    (c)本サービスの運営に支障を与える行為
    <br>
    (d)その他、本サービスの利用に関して、当社が不適切と判断する行為
    <br>
</div>
<br>
6.料金
<br>
現時点では、本サービスの利用は無料です。しかし、当社はいつでも料金を導入する権利を有し、料金が導入された場合は、利用者に対して事前に通知するものとします。
<br>
<br>
7.免責事項
<br>
<div style="margin-left:30px;line-height:2;">
(1)本サービスの利用によって、利用者に生じた損害について、当社は一切の責任を負いません。
<br>
(2)当社は、本サービスの利用によって、利用者が第三者に対して損害を与えた場合についても、一切の責任を負いません。
<br>
(3)当社はやむを得ない理由で、本サービスの提供を中断または終了する場合、それに伴い生じる損害、損失、その他の費用の賠償または補償を免れるものとします。
<br>
</div>
<br>
8.本規約の変更
<div style="margin-left:30px;line-height:2;">
(1)当社は、必要に応じて、いつでも本規約を変更することができます。
<br>
(2)変更後の規約は、当社が適切と判断する方法で利用者に通知し、その時点から効力を生じるものとします。
<br>
(3)利用者は、本規約の変更について承諾しない場合は、本サービスの利用を中止することができます。ただし、利用者が変更後の規約に基づき本サービスを利用した場合には、変更後の規約に同意したものとみなされます。
<br>
</div>
<br>
9.アカウントの削除
<br>
利用者は、いつでも自己のアカウントを削除することができます。アカウントを削除した場合、登録情報や利用履歴等の情報はすべて削除されます。
<br>
ただし、当社は、利用者が本規約に違反した場合や、当社が不適切と判断する場合には、利用者のアカウントを削除することができます。
<br>
<br>
<div id="data-handling">
10.データの取り扱い
</div>
<br>
<div style="margin-left:30px;line-height:2;">
(1)利用者がサービスを利用する際に、当社はその利用状況や操作履歴等のデータを収集することがあります。当社は、このデータを匿名化した上で統計処理を行うことができるものとします。
<br>
(2)利用者がサービスを利用する際に、当社が収集する個人情報については、当社の <a :href="$store.state.baseLocation + '/support/docs/en/privacy-policy'">「プライバシーポリシー」</a>に従って取り扱います。
<br>
(3)利用者は、当社が提供するストレージ機能を利用し、サービス内にデータを保存することができます。利用者は、このストレージ機能を利用することにより、当社がデータを保存することに同意するものとします。
<br>
(4)当社は、利用者がサービス内に保存したデータについて、適切な管理措置を講じます。ただし、当社は、データの漏洩、消失、破壊等について一切の責任を負わないものとします。
<br>
(5)利用者は、サービスの利用にあたり、第三者の著作権、商標権、プライバシー等の権利を侵害しないことを確認するものとします。利用者は、当社が第三者からの権利侵害に関するクレームを受けた場合には、自己の責任と費用負担においてこれを解決するものとします。
<br>
(6)利用者がサービスを利用することにより、当社が保存するデータに関する権利は、当社に帰属します。ただし、当社が利用者に対して別途通知した場合を除き、当社は、保存したデータを第三者に提供することはありません。
<br>
(7)契約の終了後も、当社は利用者がサービス内に保存したデータを、当社の責任のもとで保存することができるものとします。
</div>
<br>
11.知的財産権
本サービスに関する著作権、商標権、特許権、その他の知的財産権は、当社または当社にライセンスを許諾している第三者に帰属します。利用者は、当社の事前の承諾なく、これらの権利を侵害する行為を行ってはいけません。
<br>
<br>
12.本規約の適用法
<br>
<div style="margin-left:30px;line-height:2;">
(1)本規約は、日本法に従って解釈されるものとします。
(2)利用者が、日本国外に居住する場合でも、本規約の内容を理解し、同意の上で本サービスを利用することとします。利用者が居住する国の法律や国際条約に従って本サービスを利用することとし、当該法律や条約に違反しない範囲で、本サービスを利用することができます。
</div>
<br>
13.個人情報の取り扱い
<br>
当社は、本サービスにおいて利用者のプライバシーを尊重し、当社のプライバシーポリシーに従い、個人情報を取り扱うものとし、利用者は予めこれに同意するものとします。
<br>
<br>
14.損害賠償の請求
<br>
利用者が本規約の条項に違反し、当社に損害を与えた場合、当社は当該利用者に対して損害賠償の請求（弁護士費用を含む）を行う場合があります。
<br>
<br>
15.紛争解決
<br>
利用者と当社とは、本規約に関連する紛争について、その訴額に応じて、福岡簡易裁判所または福岡地方裁判所を第一審の専属的合意管轄裁判所とすることとします。
<br>
<br>
16.反社会的勢力等への対応
<br>
暴力団排除条例に準じ、暴力団関係者による本サービスの利用を禁じます。

</div>

@endsection