<template>
<div class="overlay" @mousedown="closeModal(false)">                         
    <div class="chatCreate scrollable" @mousedown.stop>     
                <div class="recordFormTitle" style="display:flex">
                    <p v-if="formIs == 1">新しい{{appNameJp}}を作成する</p>
                    <p v-if="formIs == 2">{{appNameJp}}を編集する</p>
                    <div class="cursor-pointer" @click="closeModal(false)" style="position:unset; margin:auto 0 auto auto">
                        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" class="modalWindowCloseButton" viewBox="0 0 32 32">
                            <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                        </svg>                        
                    </div> 
                </div>
    
                <div v-if="appName == 'challenge'" class="si-box" style="position:relative;">
                    <div>
                        <p :class="['form-title-small', {'form-title-active' : switchEntrySelectModel}]">楽アワードエントリー</p>
                    </div>
                    <div v-if="formIs == 1 || (formIs == 2 && editRecord.award_entry == 0)" class="selectSwitchArea" style="display: flex;width: 100%;">    
                        <input type="checkbox" id="switchEntrySelect" v-model="switchEntrySelectModel">
                        <label for="switchEntrySelect" style="min-width: 80px;" class="cursor-pointer"><span></span></label>
                        <div id="swImgEntrySelect">
                        </div>
                    </div>
                    <div v-if="formIs == 2 && editRecord.award_entry == 1" class="selectSwitchArea" style="display: flex;width: 100%;">
                        <span style="padding: 5px; margin-right: 10px;">現在エントリー中です。</span>
                    </div>
    
                </div>
         
    
                
                <div class="si-box">
                    <FormShortText
                        :validate="validate"
                        ref="recordTitle"
                        placeHolder="タイトルを入力（必須）"
                        uId="recordTitle"
                        name="recordTitle"
                        rules="required|max:48"
                        label="タイトル"
                        @setValue="val => title = val"
                    />
                </div>
                

                <div class="si-box" v-if="appName == 'challenge' || appName == 'nice'">
                    <UserSelector 
                        :selfInclude="selfInclude" 
                        :initialSelected="appName == 'challenge' ? [$store.state.user] : []"
                        :placeHolder="appName == 'challenge' ?  'プレイヤー選択（必須）' : appName == 'nice' ? '宛先選択（必須）' : ''"
                        rules="required"
                        @setUser="val => to_users = val"
                        uId="recordUsers"
                        name="recordUsers"
                        ref="recordUsers"
                    />
                </div>
                

    
                <div v-if="appName == 'challenge' && formIs == 2">
                    <div class="clear-both"></div>
                    <v-select placeholder="ステータスを選択" class="statusSelectArea" v-model="status_update" name="status_update" :options="statusOptions"></v-select>
                    
                    <div v-if="status_update && status_update.value > 0" style="padding: 20px;background: #efefef;margin: 30px 0;">
                        <span>結果発表</span>    
                        <div class="recordTextAreaLayer-01" style="margin-top: 20px;">
                            <div class="recordTextAreaLayer-02">         
                                <textarea class="recordTextArea" v-model="result_message" name="content_rule" id="" data-action="" :placeholder="appName + '結果を入力'"></textarea>
                            </div>
                        </div>
                        <div class="filedrop-area"
                            style="margin-top: 20px;"
                            @dragenter="dragEnter"
                            @dragleave="dragLeave"
                            @dragover.prevent
                            @drop.prevent="resultDropFile"
                            :class="{enter: isEnter}">   
    
                            <div v-show="noUploading" style="display:block;">
                                <label for="file-result" class="file-label">
                                ファイルアップロード
                                </label>
                                <input type="file" name="file-result" id="file-result" v-on:change="resultFileSelected" style="display: none;">
                            </div>   
    
                            <div v-show="uploading" class="uploader">
                                アップロード中
                                <br />
                                <progress ref="progress" value="0" max="100"></progress>
                            </div>   
                            <div class="preUploadImage" style="margin: 5px 15px;width: -webkit-fill-available;justify-content: center;">    
                                <div :key="image.id" v-for="image in resultFileArray" style="margin: auto 10px 10px 0;background:#fff;">
                                    <img v-if="image.mime_type === 'image'" :src="$store.state.baseLocation + '/root/post_files/' + image.id + '_' + image.user_id + '_' + image.path + '.' + image.extension">
                                    <svg v-if="image.mime_type !== 'image'" version="1.1" xmlns="http://www.w3.org/2000/svg" width="35" height="40" viewBox="0 0 27 32" :style="iconColorFilter(image.extension)">
                                        <path d="M25.954 7.013c-0.479-0.575-4.378-4.56-5.978-5.816-0.623-0.489-1.284-0.853-2.127-0.949-1.178-0.125-2.97-0.182-4.091-0.22-1.36-0.029-2.472-0.029-3.832-0.029-1.36 0.010-3.008 0.077-4.474 0.172-1.36 0.077-2.328 0.134-2.845 0.22-0.69 0.105-1.188 0.489-1.265 1.303-0.077 0.805-0.172 4.905-0.172 7.454 0.010 2.558 0.115 5.835 0.201 6.822 0.096 0.987 0.556 1.447 1.083 1.504 0.527 0.067 0.843-0.537 0.853-1.159 0.019-0.623 0.019-1.226 0.019-1.734s-0.048-2.913-0.019-5.432c0.029-2.098 0.086-4.206 0.192-6.304 0.010-0.134 0.115-0.24 0.249-0.24 0.92-0.029 1.849-0.048 2.778-0.058 1.341-0.019 2.683-0.019 4.024-0.010s2.683 0.029 4.024 0.058c0.987 0.019 1.983 0.048 2.96 0.086 0.153 0.010 0.268 0.134 0.268 0.287-0.010 0.901-0.019 3.612-0.019 3.612 0 0.546 0.010 1.083 0.019 1.629v0.010c0.010 0.546 0.45 0.987 0.996 0.987l1.705 0.019h1.705c0.441 0 1.428-0.019 1.926-0.029 0.153 0 0.287 0.125 0.297 0.278 0.048 1.399 0.067 2.807 0.077 4.216 0.010 1.878 0 3.756-0.029 5.634s-0.077 3.756-0.153 5.624c-0.067 1.514-0.144 3.037-0.268 4.532-0.019 0.201-0.182 0.355-0.383 0.364-1.418 0.038-2.778 0.067-4.302 0.077-1.648 0.010-6.266 0.010-8.163 0-1.964-0.010-5.365-0.029-7.042-0.086-0.125 0-0.24-0.153-0.259-0.278-0.058-0.374-0.105-0.834-0.163-1.389-0.067-0.623-0.469-1.092-1.035-1.025-0.45 0.048-0.824 0.45-0.891 1.198-0.067 0.738-0.019 1.619 0.067 2.213s0.441 1.016 1.198 1.14c1.006 0.163 5.72 0.249 8.057 0.268 2.347 0.019 6.275-0.019 8.259-0.019 1.974-0.010 3.286-0.019 4.857-0.182 1.121-0.115 1.408-0.747 1.552-1.715 0.24-1.667 0.345-3.325 0.469-4.982 0.134-1.887 0.24-3.775 0.326-5.672 0.086-1.887 0.144-3.784 0.192-5.672 0.029-1.428 0.038-3.21 0.019-4.235-0.010-0.948-0.287-1.782-0.862-2.472zM19.832 7.023c-0.019-0.537-0.077-2.060-0.096-2.692 0-0.096 0.105-0.144 0.182-0.086 0.537 0.489 2.491 2.271 3.152 2.874 0.077 0.067 0.029 0.192-0.077 0.182-0.719-0.029-2.434-0.086-2.98-0.105-0.096 0.010-0.182-0.077-0.182-0.172z"></path>
                                        <path d="M18.405 25.61l2.050-6.189c0.029-0.086 0.048-0.182 0.048-0.268 0-0.45-0.383-0.843-0.881-0.843h-18.74c-0.24 0-0.46 0.096-0.623 0.249s-0.259 0.364-0.259 0.604v6.189c0 0.23 0.096 0.441 0.259 0.594s0.383 0.249 0.623 0.249h16.69c0.374-0.010 0.709-0.24 0.834-0.584zM22.41 11.89c0.019-0.383-0.278-0.719-0.671-0.738-1.284-0.067-2.568-0.096-3.842-0.115-0.642-0.010-1.284-0.029-1.926-0.029l-1.926-0.010-1.926 0.010-1.926 0.029c-1.284 0.019-2.568 0.038-3.842 0.086-0.374 0.019-0.69 0.316-0.699 0.699-0.010 0.402 0.297 0.738 0.699 0.757 1.284 0.048 2.568 0.067 3.842 0.086l1.926 0.019 1.926 0.010 1.926-0.010c0.642 0 1.284-0.019 1.926-0.029 1.284-0.019 2.568-0.048 3.842-0.115 0.364-0.010 0.651-0.287 0.671-0.652zM15.875 14.63c-0.527-0.010-1.054-0.029-1.581-0.029l-1.59-0.010-1.581 0.010-1.59 0.029c-1.054 0.019-2.117 0.038-3.171 0.086-0.374 0.019-0.68 0.316-0.69 0.699-0.019 0.402 0.297 0.738 0.69 0.757 1.054 0.048 2.117 0.067 3.171 0.086l1.59 0.029 1.581 0.010 1.59-0.010c0.527 0 1.054-0.019 1.581-0.029 1.054-0.019 2.117-0.048 3.171-0.115 0.345-0.019 0.632-0.297 0.661-0.661 0.019-0.383-0.268-0.719-0.661-0.738-1.054-0.057-2.117-0.086-3.171-0.115z"></path>
                                    </svg>
                                    <p class="shared-file-name" style="line-height: 1;">{{image.name}}</p>
                                    <button @click="fileUpCancel($event, image, 'result')">
                                        <svg @click="$event.preventDefault()" version="1.1" xmlns="http://www.w3.org/2000/svg" width="7" height="7" viewBox="0 0 32 32" fill="#fff" style="pointer-events: none;">
                                            <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                                        </svg>  
                                    </button>                                                    
                                </div>                                            
                            </div>                                        
                        </div>    
                    </div> 
                </div>   

                <div class="si-box">                
                    <FormLongText
                        ref="recordBody"
                        :placeHolder="`${appNameJp}内容を入力（必須）`"
                        uId="recordBody"
                        name="recordBody"
                        rules="required|max:2000"
                        label="タイトル"
                        @setValue="val => content_rule = val"
                    />
                </div>
    
    
                <div class="si-box" v-if="appName == 'challenge'">                   
                    <FormLongText
                        ref="recordRule"
                        :placeHolder="`達成条件（必須）`"
                        uId="recordRule"
                        name="recordRule"
                        rules="required|max:2000"
                        label="タイトル"
                        @setValue="val => content_goal = val"
                    />                    
                </div>

                <div class="si-box" v-if="appName == 'challenge'">
                    <p class="form-lbl" style="font-size: 14px;">実施期間（必須）</p>
                    <div style="display:flex;margin-top: 10px;position: relative;width:100%"><DatePicker
                            ref="recordDateStart"
                            uId="recordDateStart"
                            name="recordDateStart"
                            @setValue="val => date_start = val"
                        />
                        <div style="align-self: center;margin: 0 20px;font-size: 14px;color: gray;">ー</div>
                        <DatePicker
                            ref="recordDateEnd"
                            uId="recordDateEnd"
                            name="recordDateEnd"
                            @setValue="val => date_end = val"
                        />                       
                    </div>
                    <span v-if="dateComparsionError.hasError" class="form-error" style="font-size: 12px;color:tomato;position: absolute; bottom: -15px">{{ dateComparsionError.message }}</span>       
                </div>
                
                <div class="si-box">
                    <TagSelector 
                        placeHolder="タグ選択"
                        @updated="val => tags = val"
                    />
                </div>
                
                <div class="si-box">
                    <FormFileUploader
                        @updated="val => uploadedFiles = val"
                    />
                </div>
    
                <!--<div class="filedrop-area"
                    @dragenter="dragEnter"
                    @dragleave="dragLeave"
                    @dragover.prevent
                    @drop.prevent="dropFile"
                    :class="{enter: isEnter}"
                    style="margin-top:30px">   
    
                    <div v-show="noUploading" style="display:block;">
                        <label for="file" class="file-label">
                            <span style="font-size: 14px;">ファイルアップロード</span>
                        </label>
                        <input type="file" name="file" id="file" v-on:change="fileSelected" style="display: none;">
                    </div>   
    
                    <div v-show="uploading" class="uploader">
                        <span style="font-size: 14px;">アップロード中</span>
                        <br />
                        <progress ref="progress" value="0" max="100"></progress>
                    </div>   
                    <div class="preUploadImage" style="margin: 5px 15px;width: -webkit-fill-available;justify-content: center;">    
                        <div :key="image.id" v-for="image in upFileArray" style="margin: auto 10px 10px 0;background:#fff;">
                            <img v-if="image.mime_type === 'image'" :src="$store.state.baseLocation + '/root/post_files/' + image.id + '_' + image.user_id + '_' + image.path + '.' + image.extension">
                            <svg v-if="image.mime_type !== 'image'" version="1.1" xmlns="http://www.w3.org/2000/svg" width="35" height="40" viewBox="0 0 27 32" :style="iconColorFilter(image.extension)">
                                <path d="M25.954 7.013c-0.479-0.575-4.378-4.56-5.978-5.816-0.623-0.489-1.284-0.853-2.127-0.949-1.178-0.125-2.97-0.182-4.091-0.22-1.36-0.029-2.472-0.029-3.832-0.029-1.36 0.010-3.008 0.077-4.474 0.172-1.36 0.077-2.328 0.134-2.845 0.22-0.69 0.105-1.188 0.489-1.265 1.303-0.077 0.805-0.172 4.905-0.172 7.454 0.010 2.558 0.115 5.835 0.201 6.822 0.096 0.987 0.556 1.447 1.083 1.504 0.527 0.067 0.843-0.537 0.853-1.159 0.019-0.623 0.019-1.226 0.019-1.734s-0.048-2.913-0.019-5.432c0.029-2.098 0.086-4.206 0.192-6.304 0.010-0.134 0.115-0.24 0.249-0.24 0.92-0.029 1.849-0.048 2.778-0.058 1.341-0.019 2.683-0.019 4.024-0.010s2.683 0.029 4.024 0.058c0.987 0.019 1.983 0.048 2.96 0.086 0.153 0.010 0.268 0.134 0.268 0.287-0.010 0.901-0.019 3.612-0.019 3.612 0 0.546 0.010 1.083 0.019 1.629v0.010c0.010 0.546 0.45 0.987 0.996 0.987l1.705 0.019h1.705c0.441 0 1.428-0.019 1.926-0.029 0.153 0 0.287 0.125 0.297 0.278 0.048 1.399 0.067 2.807 0.077 4.216 0.010 1.878 0 3.756-0.029 5.634s-0.077 3.756-0.153 5.624c-0.067 1.514-0.144 3.037-0.268 4.532-0.019 0.201-0.182 0.355-0.383 0.364-1.418 0.038-2.778 0.067-4.302 0.077-1.648 0.010-6.266 0.010-8.163 0-1.964-0.010-5.365-0.029-7.042-0.086-0.125 0-0.24-0.153-0.259-0.278-0.058-0.374-0.105-0.834-0.163-1.389-0.067-0.623-0.469-1.092-1.035-1.025-0.45 0.048-0.824 0.45-0.891 1.198-0.067 0.738-0.019 1.619 0.067 2.213s0.441 1.016 1.198 1.14c1.006 0.163 5.72 0.249 8.057 0.268 2.347 0.019 6.275-0.019 8.259-0.019 1.974-0.010 3.286-0.019 4.857-0.182 1.121-0.115 1.408-0.747 1.552-1.715 0.24-1.667 0.345-3.325 0.469-4.982 0.134-1.887 0.24-3.775 0.326-5.672 0.086-1.887 0.144-3.784 0.192-5.672 0.029-1.428 0.038-3.21 0.019-4.235-0.010-0.948-0.287-1.782-0.862-2.472zM19.832 7.023c-0.019-0.537-0.077-2.060-0.096-2.692 0-0.096 0.105-0.144 0.182-0.086 0.537 0.489 2.491 2.271 3.152 2.874 0.077 0.067 0.029 0.192-0.077 0.182-0.719-0.029-2.434-0.086-2.98-0.105-0.096 0.010-0.182-0.077-0.182-0.172z"></path>
                                <path d="M18.405 25.61l2.050-6.189c0.029-0.086 0.048-0.182 0.048-0.268 0-0.45-0.383-0.843-0.881-0.843h-18.74c-0.24 0-0.46 0.096-0.623 0.249s-0.259 0.364-0.259 0.604v6.189c0 0.23 0.096 0.441 0.259 0.594s0.383 0.249 0.623 0.249h16.69c0.374-0.010 0.709-0.24 0.834-0.584zM22.41 11.89c0.019-0.383-0.278-0.719-0.671-0.738-1.284-0.067-2.568-0.096-3.842-0.115-0.642-0.010-1.284-0.029-1.926-0.029l-1.926-0.010-1.926 0.010-1.926 0.029c-1.284 0.019-2.568 0.038-3.842 0.086-0.374 0.019-0.69 0.316-0.699 0.699-0.010 0.402 0.297 0.738 0.699 0.757 1.284 0.048 2.568 0.067 3.842 0.086l1.926 0.019 1.926 0.010 1.926-0.010c0.642 0 1.284-0.019 1.926-0.029 1.284-0.019 2.568-0.048 3.842-0.115 0.364-0.010 0.651-0.287 0.671-0.652zM15.875 14.63c-0.527-0.010-1.054-0.029-1.581-0.029l-1.59-0.010-1.581 0.010-1.59 0.029c-1.054 0.019-2.117 0.038-3.171 0.086-0.374 0.019-0.68 0.316-0.69 0.699-0.019 0.402 0.297 0.738 0.69 0.757 1.054 0.048 2.117 0.067 3.171 0.086l1.59 0.029 1.581 0.010 1.59-0.010c0.527 0 1.054-0.019 1.581-0.029 1.054-0.019 2.117-0.048 3.171-0.115 0.345-0.019 0.632-0.297 0.661-0.661 0.019-0.383-0.268-0.719-0.661-0.738-1.054-0.057-2.117-0.086-3.171-0.115z"></path>
                            </svg>
                            <p class="shared-file-name" style="line-height: 1;">{{image.name}}</p>
                            <button @click="fileUpCancel($event, image, 'attach')">
                                <svg @click="$event.preventDefault()" version="1.1" xmlns="http://www.w3.org/2000/svg" width="7" height="7" viewBox="0 0 32 32" fill="#fff" style="pointer-events: none;">
                                    <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                                </svg>  
                            </button>                                                    
                        </div>                                            
                    </div>
                    <div v-if="forwardedFiles.length" class="preUploadImage" style="margin: 5px 15px;width: -webkit-fill-available;justify-content: center;">    
                        <div :key="image.id" v-for="image in forwardedFiles" style="margin: auto 10px 10px 0;background:#fff;">
                            <img v-if="image.mime_type === 'image'" :src="$store.state.baseLocation + '/managed_files/' + image.source_board_id + '/' + image.path + '.' + image.extension">
                            <svg v-if="image.mime_type !== 'image'" version="1.1" xmlns="http://www.w3.org/2000/svg" width="35" height="40" viewBox="0 0 27 32" :style="iconColorFilter(image.extension)">
                                <path d="M25.954 7.013c-0.479-0.575-4.378-4.56-5.978-5.816-0.623-0.489-1.284-0.853-2.127-0.949-1.178-0.125-2.97-0.182-4.091-0.22-1.36-0.029-2.472-0.029-3.832-0.029-1.36 0.010-3.008 0.077-4.474 0.172-1.36 0.077-2.328 0.134-2.845 0.22-0.69 0.105-1.188 0.489-1.265 1.303-0.077 0.805-0.172 4.905-0.172 7.454 0.010 2.558 0.115 5.835 0.201 6.822 0.096 0.987 0.556 1.447 1.083 1.504 0.527 0.067 0.843-0.537 0.853-1.159 0.019-0.623 0.019-1.226 0.019-1.734s-0.048-2.913-0.019-5.432c0.029-2.098 0.086-4.206 0.192-6.304 0.010-0.134 0.115-0.24 0.249-0.24 0.92-0.029 1.849-0.048 2.778-0.058 1.341-0.019 2.683-0.019 4.024-0.010s2.683 0.029 4.024 0.058c0.987 0.019 1.983 0.048 2.96 0.086 0.153 0.010 0.268 0.134 0.268 0.287-0.010 0.901-0.019 3.612-0.019 3.612 0 0.546 0.010 1.083 0.019 1.629v0.010c0.010 0.546 0.45 0.987 0.996 0.987l1.705 0.019h1.705c0.441 0 1.428-0.019 1.926-0.029 0.153 0 0.287 0.125 0.297 0.278 0.048 1.399 0.067 2.807 0.077 4.216 0.010 1.878 0 3.756-0.029 5.634s-0.077 3.756-0.153 5.624c-0.067 1.514-0.144 3.037-0.268 4.532-0.019 0.201-0.182 0.355-0.383 0.364-1.418 0.038-2.778 0.067-4.302 0.077-1.648 0.010-6.266 0.010-8.163 0-1.964-0.010-5.365-0.029-7.042-0.086-0.125 0-0.24-0.153-0.259-0.278-0.058-0.374-0.105-0.834-0.163-1.389-0.067-0.623-0.469-1.092-1.035-1.025-0.45 0.048-0.824 0.45-0.891 1.198-0.067 0.738-0.019 1.619 0.067 2.213s0.441 1.016 1.198 1.14c1.006 0.163 5.72 0.249 8.057 0.268 2.347 0.019 6.275-0.019 8.259-0.019 1.974-0.010 3.286-0.019 4.857-0.182 1.121-0.115 1.408-0.747 1.552-1.715 0.24-1.667 0.345-3.325 0.469-4.982 0.134-1.887 0.24-3.775 0.326-5.672 0.086-1.887 0.144-3.784 0.192-5.672 0.029-1.428 0.038-3.21 0.019-4.235-0.010-0.948-0.287-1.782-0.862-2.472zM19.832 7.023c-0.019-0.537-0.077-2.060-0.096-2.692 0-0.096 0.105-0.144 0.182-0.086 0.537 0.489 2.491 2.271 3.152 2.874 0.077 0.067 0.029 0.192-0.077 0.182-0.719-0.029-2.434-0.086-2.98-0.105-0.096 0.010-0.182-0.077-0.182-0.172z"></path>
                                <path d="M18.405 25.61l2.050-6.189c0.029-0.086 0.048-0.182 0.048-0.268 0-0.45-0.383-0.843-0.881-0.843h-18.74c-0.24 0-0.46 0.096-0.623 0.249s-0.259 0.364-0.259 0.604v6.189c0 0.23 0.096 0.441 0.259 0.594s0.383 0.249 0.623 0.249h16.69c0.374-0.010 0.709-0.24 0.834-0.584zM22.41 11.89c0.019-0.383-0.278-0.719-0.671-0.738-1.284-0.067-2.568-0.096-3.842-0.115-0.642-0.010-1.284-0.029-1.926-0.029l-1.926-0.010-1.926 0.010-1.926 0.029c-1.284 0.019-2.568 0.038-3.842 0.086-0.374 0.019-0.69 0.316-0.699 0.699-0.010 0.402 0.297 0.738 0.699 0.757 1.284 0.048 2.568 0.067 3.842 0.086l1.926 0.019 1.926 0.010 1.926-0.010c0.642 0 1.284-0.019 1.926-0.029 1.284-0.019 2.568-0.048 3.842-0.115 0.364-0.010 0.651-0.287 0.671-0.652zM15.875 14.63c-0.527-0.010-1.054-0.029-1.581-0.029l-1.59-0.010-1.581 0.010-1.59 0.029c-1.054 0.019-2.117 0.038-3.171 0.086-0.374 0.019-0.68 0.316-0.69 0.699-0.019 0.402 0.297 0.738 0.69 0.757 1.054 0.048 2.117 0.067 3.171 0.086l1.59 0.029 1.581 0.010 1.59-0.010c0.527 0 1.054-0.019 1.581-0.029 1.054-0.019 2.117-0.048 3.171-0.115 0.345-0.019 0.632-0.297 0.661-0.661 0.019-0.383-0.268-0.719-0.661-0.738-1.054-0.057-2.117-0.086-3.171-0.115z"></path>
                            </svg>
                            <p class="shared-file-name" style="line-height: 1;">{{image.name}}</p>
                            <button @click="fileForwardCancel(image)">
                                <svg @click="$event.preventDefault()" version="1.1" xmlns="http://www.w3.org/2000/svg" width="7" height="7" viewBox="0 0 32 32" fill="#fff" style="pointer-events: none;">
                                    <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                                </svg>  
                            </button>                                                    
                        </div>                                            
                    </div> 
                    <div v-if="sharedFromFiles.length" class="preUploadImage" style="margin: 5px 15px;width: -webkit-fill-available;justify-content: center;">    
                        <div :key="file.id" v-for="file in sharedFromFiles" style="margin: auto 10px 10px 0;background:#fff;">
                            <img v-if="file.mime_type === 'image'" 
                            :src="file.temp_path">
                            <svg v-if="file.mime_type !== 'image'" version="1.1" xmlns="http://www.w3.org/2000/svg" width="35" height="40" viewBox="0 0 27 32" :style="iconColorFilter(file.extension)">
                                <path d="M25.954 7.013c-0.479-0.575-4.378-4.56-5.978-5.816-0.623-0.489-1.284-0.853-2.127-0.949-1.178-0.125-2.97-0.182-4.091-0.22-1.36-0.029-2.472-0.029-3.832-0.029-1.36 0.010-3.008 0.077-4.474 0.172-1.36 0.077-2.328 0.134-2.845 0.22-0.69 0.105-1.188 0.489-1.265 1.303-0.077 0.805-0.172 4.905-0.172 7.454 0.010 2.558 0.115 5.835 0.201 6.822 0.096 0.987 0.556 1.447 1.083 1.504 0.527 0.067 0.843-0.537 0.853-1.159 0.019-0.623 0.019-1.226 0.019-1.734s-0.048-2.913-0.019-5.432c0.029-2.098 0.086-4.206 0.192-6.304 0.010-0.134 0.115-0.24 0.249-0.24 0.92-0.029 1.849-0.048 2.778-0.058 1.341-0.019 2.683-0.019 4.024-0.010s2.683 0.029 4.024 0.058c0.987 0.019 1.983 0.048 2.96 0.086 0.153 0.010 0.268 0.134 0.268 0.287-0.010 0.901-0.019 3.612-0.019 3.612 0 0.546 0.010 1.083 0.019 1.629v0.010c0.010 0.546 0.45 0.987 0.996 0.987l1.705 0.019h1.705c0.441 0 1.428-0.019 1.926-0.029 0.153 0 0.287 0.125 0.297 0.278 0.048 1.399 0.067 2.807 0.077 4.216 0.010 1.878 0 3.756-0.029 5.634s-0.077 3.756-0.153 5.624c-0.067 1.514-0.144 3.037-0.268 4.532-0.019 0.201-0.182 0.355-0.383 0.364-1.418 0.038-2.778 0.067-4.302 0.077-1.648 0.010-6.266 0.010-8.163 0-1.964-0.010-5.365-0.029-7.042-0.086-0.125 0-0.24-0.153-0.259-0.278-0.058-0.374-0.105-0.834-0.163-1.389-0.067-0.623-0.469-1.092-1.035-1.025-0.45 0.048-0.824 0.45-0.891 1.198-0.067 0.738-0.019 1.619 0.067 2.213s0.441 1.016 1.198 1.14c1.006 0.163 5.72 0.249 8.057 0.268 2.347 0.019 6.275-0.019 8.259-0.019 1.974-0.010 3.286-0.019 4.857-0.182 1.121-0.115 1.408-0.747 1.552-1.715 0.24-1.667 0.345-3.325 0.469-4.982 0.134-1.887 0.24-3.775 0.326-5.672 0.086-1.887 0.144-3.784 0.192-5.672 0.029-1.428 0.038-3.21 0.019-4.235-0.010-0.948-0.287-1.782-0.862-2.472zM19.832 7.023c-0.019-0.537-0.077-2.060-0.096-2.692 0-0.096 0.105-0.144 0.182-0.086 0.537 0.489 2.491 2.271 3.152 2.874 0.077 0.067 0.029 0.192-0.077 0.182-0.719-0.029-2.434-0.086-2.98-0.105-0.096 0.010-0.182-0.077-0.182-0.172z"></path>
                                <path d="M18.405 25.61l2.050-6.189c0.029-0.086 0.048-0.182 0.048-0.268 0-0.45-0.383-0.843-0.881-0.843h-18.74c-0.24 0-0.46 0.096-0.623 0.249s-0.259 0.364-0.259 0.604v6.189c0 0.23 0.096 0.441 0.259 0.594s0.383 0.249 0.623 0.249h16.69c0.374-0.010 0.709-0.24 0.834-0.584zM22.41 11.89c0.019-0.383-0.278-0.719-0.671-0.738-1.284-0.067-2.568-0.096-3.842-0.115-0.642-0.010-1.284-0.029-1.926-0.029l-1.926-0.010-1.926 0.010-1.926 0.029c-1.284 0.019-2.568 0.038-3.842 0.086-0.374 0.019-0.69 0.316-0.699 0.699-0.010 0.402 0.297 0.738 0.699 0.757 1.284 0.048 2.568 0.067 3.842 0.086l1.926 0.019 1.926 0.010 1.926-0.010c0.642 0 1.284-0.019 1.926-0.029 1.284-0.019 2.568-0.048 3.842-0.115 0.364-0.010 0.651-0.287 0.671-0.652zM15.875 14.63c-0.527-0.010-1.054-0.029-1.581-0.029l-1.59-0.010-1.581 0.010-1.59 0.029c-1.054 0.019-2.117 0.038-3.171 0.086-0.374 0.019-0.68 0.316-0.69 0.699-0.019 0.402 0.297 0.738 0.69 0.757 1.054 0.048 2.117 0.067 3.171 0.086l1.59 0.029 1.581 0.010 1.59-0.010c0.527 0 1.054-0.019 1.581-0.029 1.054-0.019 2.117-0.048 3.171-0.115 0.345-0.019 0.632-0.297 0.661-0.661 0.019-0.383-0.268-0.719-0.661-0.738-1.054-0.057-2.117-0.086-3.171-0.115z"></path>
                            </svg>
                            <p class="shared-file-name" style="line-height: 1;">dd{{file.name}}</p>
                            <button @click="tempFilesCancel(file)">
                                <svg @click="$event.preventDefault()" version="1.1" xmlns="http://www.w3.org/2000/svg" width="7" height="7" viewBox="0 0 32 32" fill="#fff" style="pointer-events: none;">
                                    <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                                </svg>  
                            </button>                                                    
                        </div>                                            
                    </div> 
                </div>            
                <div>
                    <ul>
                        <li :key="file.id" v-for="file in fileInfo">{{ file.name }}</li>
                    </ul>
                </div>   --> 
                    
                    
                <div class="si-box">
                    <FormShortText
                        placeHolder="参照元URLを入力"
                        uId="recordUrl"
                        name="recordUrl"
                        rules=""
                        label="タイトル"
                        @setValue="(val) => referrer = val"
                    />
                </div>        
                
                
                <div class="si-box">
                    <LoaderButton @click="createSend" :loading="processing" content="投稿する"/>
                </div>
                
       
    </div>
</div>       
           
    </template>

    <script>      
    import FormShortText from '../Global/FormShortText.vue'
    import FormLongText from '../Global/FormLongText.vue'
    import UserSelector from '../Global/UserSelector.vue'
    import { Field  } from 'vee-validate'
    import TagSelector from '../Global/TagSelector.vue'
    import LoaderButton from '../Global/LoaderButton.vue'
    import DatePicker from '../Global/DatePicker.vue'
    import FormFileUploader from '../Global/FormFileUploader.vue'
    import moment from 'moment'
        export default {
            props: ['formIs', 'currentStatus', 'editRecord', 'sharedFrom', 'filesToShare', 'appNameJp', 'appName'],
            data (){
                return {
                    title:"",
                    content:"",
                    content_rule:"",
                    content_goal:"",
                    to_users: [],
                    referrer: '',
                    editIndex: -1,
                    load: true,    
                    options: [],
                    tagOptions: [],               
                    fileInfo: '',
                    tags: [],              
                    isEnter: false,
                    uploading: false,
                    noUploading: true,
                    upFileArray: [],
                    deleteFileArray: [],
                    resultDeleteFileArray: [],
                    date_start: '',
                    date_end: '',
                    DatePickerFormat: 'yyyy-MM-dd',
                    processing: false,
                    result_message: '',
                    resultFileArray: [],
                    forwardedFiles: [],
                    sourceBoardId: null,
                    status_update: null,
                    statusOptions: [
                        {label: '実施中', value: '0'},
                        {label: '達成', value: '1'},
                        {label: '未達成', value: '2'},
                        {label: '中止', value: '3'},
                        
                    ],
                    sharedTempFiles: [],
                    //20230323 チャレンジ改修 #001
                    switchEntrySelectModel: false,
                    validate: 0,
                    uploadedFiles: []
    
                }
            },
            components:{FormShortText, FormLongText, UserSelector, Field, TagSelector, LoaderButton, DatePicker, FormFileUploader},
            computed: {
                sharedFromFiles(){
                    return this.sharedTempFiles
                },
                
                selfInclude(){
                    return this.appName == 'challenge' ? true : false
                },
                dateComparsionError(){
                    if(this.date_start && this.date_end){

                        const wrongDuration = moment(this.date_start).isAfter(this.date_end, 'day');                    
                        return{
                            hasError: wrongDuration,
                            message: wrongDuration ? '終了日は開始日より前にすることはできません。' : ''
                        }                       

                    }else{
                        return {
                            hasError: false,
                            message: ''
                        }
                    }
                }
    
            },
            methods : {
                async validation(){
                    
                  
                    try {
                        
                        
                        let checkRef = ['recordTitle', 'recordBody'];
                        if(this.appName == 'challenge'){
                            checkRef.push('recordRule', 'recordDateStart', 'recordDateEnd', 'recordUsers')
                        }
                        let result = true
                        for(const check of checkRef){
                            const exec = await this.$refs[check].$refs[check].validate()
                            result = result * exec.valid
                        }
                        
                        
                        return result
                    } catch (error) {
                        console.error('Error fetching data:', error);
                        throw error; // Re-throw the error to handle it further if needed
                    }
                    
                    
                },
                async createSend(){
                    
                    this.processing = true
                    const valid = await this.validation()
                    if(!valid){
                        this.processing = false
                        return
                    }
                     try {
                        
                        const params = {
                            to_users: this.to_users.length ? this.to_users.map(ob => ob.id) : [], 
                            title: this.title, 
                            content_rule: this.content_rule, 
                            content_goal: this.content_goal, 
                            date_start: this.date_start, 
                            date_end: this.date_end,  
                            tags: this.tags.length ? this.tags.map(ob => ob.text) : [], 
                            file_ids : this.uploadedFiles.length ? this.uploadedFiles.map(ob => ob.id) : [], 
                            referrer: this.referrer, 
                            forwarded_files: this.forwardedFiles, 
                            shared_temp_files: this.sharedTempFiles,
                            path: this.appName,
                            content: this.content_rule,
                            award_entry: this.switchEntrySelectModel ? 1 : 0
                        }
               
                        axios.post('post_add_record',params)
                        .then(response => setTimeout(() => {this.closeModal(true)},0))
                        .catch(function (error) {
                            if (error.response) this.errorToast('エラーが発生しました。 ' + error.response.data.message)
                            else if (error.request) this.errorToast('エラーが発生しました。')
                            else this.errorToast('エラーが発生しました。 ' + error.message)   
                            this.$store.commit('setUrlMessageId', null)      
                            this.processing = false                    
                        }.bind(this));
                        
                    } catch (error) {
                        console.error('Error fetching data:', error);
                        this.processing = false
                    }
                    
                    

                    
                },
                closeModal(flag){
                    this.processing = false
                    this.$emit('postFinish',flag);              
                },
                pushUserSelect(all_users){
                    const list = this.appName == 'nice' ? all_users.filter(ob => ob.id !== this.$store.state.user.id) : all_users
                    let options = [];
                    list.map(user => options.push({ label : user.name , value : user.id }))
                    this.options = options;
                    if(this.formIs == 1 && this.appName == 'challenge'){                    
                        const me = options.filter(ob => ob.value == this.$store.state.user.id)
                        if(me.length){
                            this.to_users.push(me[0])
                        }
                    }
                },
                pushTagSelect(tag_text){
    
                    var tagOptions = [];
                    for(var i in tag_text){
    
                        var item = tag_text[i];
                        tagOptions.push({ label : item.text , value : item.id });
    
                    }
    
                    // alert(JSON.stringify(tag_text));
    
                    this.tagOptions = tagOptions;
                    //this.options.value = optionsId;
    
                },
                recordAdd(isValid){             
    
    
                    if (isValid == true) return
                    //20211215_#0015 2重保存対策
                    if (this.processing) return;
                    this.processing = true;
                    //20211215_#0015 2重保存対策
    
                    var filesList = [];
                    var list =  this.upFileArray
                    for(var i in list){
                        var file = list[i].id + '_' + list[i].user_id + '_' + list[i].path + '.' + list[i].extension;                    
                        filesList.push(file);
                    }                    
                        
                    const UpFileArray = filesList;
                    var resultFilesList = [];
                    var resultList =  this.resultFileArray
                    for(var i in resultList){
                        var result_file = resultList[i].id + '_' + resultList[i].user_id + '_' + resultList[i].path + '.' + resultList[i].extension;                    
                        resultFilesList.push(result_file);
                    }
                        
                    //アップロードファイル名配列の取得
                    const ResultFileArray = resultFilesList;
    
                    //to_users 複数選択時の「,」区切り格納処理
                    const to_users_array = [];
                    const to_users = this.to_users;
    
                    for(var i in to_users){
                        var item = to_users[i];
                        to_users_array.push(item.value);
                    }
                    const str_to_users = to_users_array;
    
                    //to_users 複数選択時の「,」区切り格納処理
                    const tags_array = [];
                    const tags = this.tags;
    
                    for(var i in tags){
                        var item = tags[i];
                        tags_array.push(item.label);
                    }
                    const str_tags = tags_array;
                    const params = {
                        to_users: str_to_users, 
                        title: this.title, 
                        content_rule: this.content_rule, 
                        content_goal: this.content_goal, 
                        date_start: this.date_start, 
                        date_end: this.date_end,  
                        tags: str_tags, 
                        file : UpFileArray, 
                        referrer: this.referrer, 
                        forwarded_files: this.forwardedFiles, 
                        shared_temp_files: this.sharedTempFiles,
                        app_name: this.appName,
                        content: this.content_rule,
                        //20230323 チャレンジ改修 #001
                        award_entry: this.switchEntrySelectModel
    
                    }
    
                    if(this.editIndex === -1) {    
                        const url = `${this.appName}/messages_add_api`              
                        axios.post(url,params).then(response => setTimeout(() => {this.closeModal(true)},0))
                        .catch(function (error) {
                            if (error.response) this.errorToast('エラーが発生しました。 ' + error.response.data.message)
                            else if (error.request) this.errorToast('エラーが発生しました。')
                            else this.errorToast('エラーが発生しました。 ' + error.message)   
                            this.$store.commit('setUrlMessageId', null)                           
                        }.bind(this));
    
                    }else{
                        
                        // return;
                        var status_flag = '';
    
                        if(!this.status_update){
                            EventBus.$emit('setToast', {
                                active: true,  
                                type: 'info', 
                                content: 'ステータスを選択してください。' ,
                                closeButton: true, 
                                autoClose: false,
                                answers: ['OK'],
                            }) 
    
                            //20211215_#0015 2重保存対策
                            this.processing = false;
                            //20211215_#0015 2重保存対策
    
                            return;                       
                            
                        }
                        status_flag = Number(this.status_update.value);
                        if(status_flag == null){
                            EventBus.$emit('setToast', {
                                active: true,  
                                type: 'info', 
                                content: 'ステータスを選択してください。' ,
                                closeButton: true, 
                                autoClose: false,
                                answers: ['OK'],
                            }) 
                            return
                        }
                        
    
                        const editId = this.id;
    
                        const params = {
                            id: this.id ,
                            to_users: str_to_users, 
                            title: this.title,
                            content_rule: this.content_rule , 
                            content_goal: this.content_goal , 
                            date_start: this.date_start , 
                            date_end: this.date_end,
                            tags: str_tags,
                            file : UpFileArray,
                            result_file: ResultFileArray,                        
                            deleteFile: this.deleteFileArray,
                            resultDeleteFile: this.resultDeleteFileArray,
                            referrer: this.referrer, 
                            status: status_flag,
                            result_message: this.result_message,
    
                            //20230323 チャレンジ改修 #001
                            award_entry: this.switchEntrySelectModel
    
                        } 
                        axios.post('post_add_record', params).then(response => setTimeout(() => {this.closeModal(true)},500))
                        .catch(function (error) {
                            if (error.response) this.errorToast(this.$t(error.response.data.message))
                            else if (error.request) this.errorToast(this.$t('commonError'))
                            else this.errorToast(this.$t('commonError'))                           
                        }.bind(this));
    
    
                    }
    
                    //alert(JSON.stringify(this))
    
                },
                errorToast(message){
                    emitter.emit('setToast', {
                        active: true,  
                        type: 'info', 
                        content: message,
                        closeButton: false, 
                        autoClose: false,
                        answers: ['OK']

                    })  
                    this.processing = false
                    
                },
                challengeEdit(item){
    
                    setTimeout(() => {
                        this.status_update = null;
                        var tempLabel = '';                    
                        if(item.status_flag == 0){
                            tempLabel = '実施中'
                        }else if(item.status_flag == 1){
                            tempLabel = '達成'
                        }else if(item.status_flag == 2){
                            tempLabel = '未達成'
                        }else if(item.status_flag == 3){
                            tempLabel = '中止'
                        }
                        let a = {
                            "label": tempLabel,
                            "value": item.status_flag
                        }
                        this.status_update = a;                 
                    }, 0);
                    
    
                    this.editIndex = item.id;
                    this.id = item.id;
                    this.title = item.title;
                    this.content = item.content;
                    this.content_rule = item.content_rule || item.content;
                    this.content_goal = item.content_goal;
                    this.date_start = item.date_start;
                    this.date_end = item.date_end;
                    this.referrer = item.referrer;
                    this.result_message = item.result;
    
                    //20230323 チャレンジ改修 #001
                    this.switchEntrySelectModel = item.award_entry == 0 ? false : true;
                    
                    var temp = [];
                    var resultTemp = [];
    
                    const child_props_files = this.appName + '_use_files'
                    for(var file of item[child_props_files]){ 
                        if(this.appName == 'challenge' && file.result_flag == 1){
                            resultTemp.push(file.file_records);                       
                        }else{
                            temp.push(file.file_records);
                        }
                        
                                         
                    }
                    this.upFileArray = temp;
                    this.resultFileArray = resultTemp;
                    var tempTags = [];
                    const child_props_tags = this.appName + '_use_tags'
                    for(var tag of item[child_props_tags]){ 
                        tempTags.push({ label : tag.tag_records.text , value : tag.tag_records.id })
                    }
                    this.tags = tempTags;
    
                    var tempUsers = [];
                    const child_props_users = this.appName + '_to_users'
                    for(var user of item[child_props_users]){                                        
                        tempUsers.push({ label : user.user.name , value : user.user.id });
                    }
                    this.to_users = tempUsers;
    
                },
    
                fileSelected(event){
    
                    this.fileInfo = event.target.files[0];
                    
                    this.fileUpload('attach');
    
    
                },
                resultFileSelected(event){
    
                    this.fileInfo = event.target.files[0];
                    
                    this.fileUpload('result');
    
    
                },
                
                dragEnter: function(){
    
                    this.isEnter = true;
    
                    // alert('aaaa');
                    
                },
                dragLeave: function(){
    
                    // alert('22222');
                    this.isEnter = false;
    
                },
                // dragOver: function(){
                //     // alert('77777');
                // },
                
                resultDropFile: function(){
    
                    
    
                    this.fileInfo = event.dataTransfer.files;
    
                    // this.fileInfo = [...event.dataTransfer.files]
                    // // this.fileInfo = event.target.files[0];
                    
    
                    this.isEnter = false;
    
                    this.fileUpload('result');
    
                },
    
                
                fileForwardCancel(item){
                    this.forwardedFiles = this.forwardedFiles.filter( obj => obj !== item)
                },
                tempFilesCancel(item){
                    this.sharedTempFiles = this.forwardedFiles.filter( obj => obj !== item)
                },
                fileUpCancel: function(event, upfile, which){
                    if(which === 'attach'){                   
                        this.upFileArray = this.upFileArray.filter( obj => obj !== upfile);
                        this.deleteFileArray.push(upfile.id);
                    }else if(which === 'result'){
                       this.resultFileArray = this.resultFileArray.filter( obj => obj !== upfile);
                       this.resultDeleteFileArray.push(upfile.id);
                    }     
                },   
                getTags(){
                    axios.get('/post_get_tags').then(response => {
                        this.pushTagSelect(response.data)
                    });
                },
                getUsers(){
                    axios.get('/post_get_users').then(response => {
                        this.pushUserSelect(response.data)
                    });
                },     
                iconColorFilter: function (ext) {
                    var extensions = ["xlsx", "xlsm", "xlsb", "xltx", "xls", "xml", "xlam", "xlr", "xlw", "xla",
                        "doc", "docm", "docx", "dot", "dotx",
                        "potm", "potx", "ppam", "pps", "ppsm", "ppsx", "ppt", "pptm", "pptx",
                        "pdf",
                    ]
                    var format = extensions.indexOf(ext);
                    var result;
                    switch (true) {
                        case (format >= 0 && format <= 9):
                            result = "fill: #1D6F42";
                            break;
                        case (format >= 10 && format <= 14):
                            result = "fill: #0078d7";
                            break;
                        case (format >= 15 && format <= 23):
                            result = "fill: #d04423";
                            break;
                        case (format == 24):
                            result = "fill: #ff0000";
                            break;
                        default:
                            result = null;
                    }
                    return result;
                },    
            },
            
            mounted() {
                if(this.sharedFrom){
                    if(this.sharedFrom.flag == 1){
                        this.content_rule = this.sharedFrom.message.message_text
                    }                
                    this.sharedTempFiles = this.sharedFrom.files
                    
                }
                if(this.filesToShare){
                    this.forwardedFiles = this.filesToShare
                    
                }
                this.status_update = this.currentStatus
                if(this.editRecord){
                    this.challengeEdit(this.editRecord)
                }
                // this.getUsers();
                // this.getTags();
    
            },
    
            filters: {            
                fileSize: function (bytes, decimals = 2) {
                    if (bytes === 0) return '0 Bytes';
    
                    const k = 1024;
                    const dm = decimals < 0 ? 0 : decimals;
                    const sizes = ['Bytes', 'KB', 'MB', 'GB', 'TB', 'PB', 'EB', 'ZB', 'YB'];
    
                    const i = Math.floor(Math.log(bytes) / Math.log(k));
    
                    return parseFloat((bytes / Math.pow(k, i)).toFixed(dm)) + ' ' + sizes[i];
                },
                fileNameFilter: function (name, ext) {
    
                    var str_lenght = name.length;
                    if (str_lenght > 20) {
                        var sliced = name.slice(0, 20) + " ..." + ext;
                        return sliced;
                    }
                    return name;
    
                },
    
                
            }
        }
    
    </script>
<style>

    .post-error{
        bottom: -12px !important;
    }
    .selectSwitchArea {
        line-height    : 32px;            
        letter-spacing : 0;                   /* 文字間             */
        text-align     : center;              /* 文字位置は中央     */
        font-size      : 14px;                /* 文字サイズ         */
        position       : relative;            /* 親要素が基点       */
        /*margin         : auto;*/                /* 中央寄せ           */
        width          : 80px;               /* ボタンの横幅       */
        /*background     : #fff;*/                /* デフォルト背景色   */
        margin-top: 20px;
    }

    /* === チェックボックス ==================================== */
    .selectSwitchArea input[type="checkbox"]{
        display        : none;            /* チェックボックス非表示 */
    }

    /* === チェックボックスのラベル（標準） ==================== */
    .selectSwitchArea label{
        display        : block;               /* ボックス要素に変更 */
        box-sizing     : border-box;          /* 枠線を含んだサイズ */
        height         : 32px;                /* ボタンの高さ       */
        /*border         : 2px solid #000000;*/   /* 未選択タブのの枠線 */
        border-radius  : 30px;                /* 角丸               */
        background     : var(--check-inactive);
    }

    /* === チェックボックスのラベル（ONのとき） ================ */
    .selectSwitchArea input[type="checkbox"]:checked +label{
                /* 選択タブの枠線     */
        background     : #424242;
    }

    /* === 表示する文字（標準） ================================ */
    .selectSwitchArea label span:after{
        content        : "OFF";               /* 表示する文字       */
        padding        : 0 0 0 38px;          /* 表示する位置       */
        color          : #000000;             /* 文字色             */
    }

    /* === 表示する文字（ONのとき） ============================ */
    .selectSwitchArea input[type="checkbox"]:checked + label span:after{
        content        : "ON";                /* 表示する文字       */
        padding        : 0 40px 0 10px;          /* 表示する位置       */
        color          : #ffffff;             /* 文字色             */
    }

    /* === 丸部分のSTYLE（標準） =============================== */
    .selectSwitchArea #swImgEntrySelect{
        position       : absolute;            /* 親要素からの相対位置*/
        width          : 22px;                /* 丸の横幅           */
        height         : 22px;                /* 丸の高さ           */
        background     : #fff;             /* カーソルタブの背景 */
        top            : 4px;                 /* 親要素からの位置   */
        left           : 5px;                 /* 親要素からの位置   */
        border-radius  : 26px;                /* 角丸               */
        transition     : .2s;                 /* 滑らか変化         */
        color          : #ffffff;
        line-height    : 22px;
        border: 1px solid #ccc;
    }

    /* === 丸部分のSTYLE（ONのとき） =========================== */
    .selectSwitchArea input[type="checkbox"]:checked ~ #swImgEntrySelect{
        transform      : translateX(46px);    /* 丸も右へ移動       */
        background     : #fff;             /* カーソルタブの背景 */
        border: 1px solid #ccc;
    }
    .switchElement{
        width: 100%;
    }
    .switchLabel{
        width: calc(100% / 5 - 30px);
        text-align: left;
        line-height: 30px;
    }
    .si-box{
        background: inherit;
        margin-top: 30px;
    }
    .form-title-small{
        white-space: nowrap;
        color:gray;
        font-size:14px;
        transition: color 0.3s ease;
    }
    .form-title-active{
        color: var(--primary-color);
    }

</style>
    
    
    
    
    
    