@extends('layouts.app')
@section('title', 'GLOWD - Үйлчилгээний нөхцөл')
@section('content')

<div style="color:var(--primary-color);background-color:var(--background-color);padding: 3em;">

<h1 style="font-size: 24px;">Үйлчилгээний нөхцөл</h1>
<br>
<div style="line-height:2;">
Glowd (цаашид "Үйлчилгээ" гэх) нь Glowd Inc.-ээс (цаашид "манай компани" гэх) үүлэнд суурилсан бизнесийн чат үйлчилгээ юм.
<br>
Энэхүү гэрээ нь энэхүү үйлчилгээг ашиглах нөхцөлийг тодорхойлсон бөгөөд энэ үйлчилгээний бүх хэрэглэгчдэд (цаашид "хэрэглэгч" гэх) хамаарна.
<br>
Хэрэглэгч эдгээр нөхцлийг зөвшөөрснөөр үйлчилгээг ашиглах боломжтой болно. Компани нь хэрэглэгчийн зөвшөөрлийг авалгүйгээр эдгээр нөхцөлийг өөрчилж болно.
<br>
Хэрэглэгч оруулсан өөрчлөлтийн агуулгыг баталгаажуулсан эсэхээс үл хамааран хэрэглэгч тухайн өөрчлөлтийн дараа энэхүү үйлчилгээг ашигласан тохиолдолд хэрэглэгч энэхүү гэрээг өөрчлөхийг зөвшөөрсөнд тооцно.
<br>
Энэхүү гэрээ нь энэ үйлчилгээний бүх хэрэглэгчдэд хамаарна.
<br>
<br>
1 Акаунт бүртгэл
<br>
<div style="margin-left:30px;line-height:2;">
(1) Энэ үйлчилгээг ашиглахын тулд хэрэглэгч бүртгүүлэх ёстой.
<br>
(2) Та бүртгэлээ бүртгүүлэхдээ мэйл хаяг, гар утасны дугаар эсвэл сошиал хаягаа ашиглаж болно.
<br>
(3) Хэрэглэгчид өөрсдийн эрсдэлээр акаунт бүртгүүлэх бөгөөд бүртгүүлсэн мэдээллийнхээ үнэн зөв, бодитой байдлыг хариуцна.
<br>
(4) Хэрэглэгч үйлчилгээнд бүртгэлээ бүртгүүлж дууссаны дараа Компани нь эдгээр нөхцөлийг зөвшөөрсөнд тооцогдох бөгөөд үйлчилгээг ашиглаж эхэлсэн өдөр нь акаунт бүртгэл дууссан өдөр байна.
<br>
(5) Ашиглаж эхлэх огноог Японы цагаар үндэслэнэ.
<br>
</div>
<br>
2 Нууц үгийн хяналт
<br>
    <div style="margin-left: 30px;line-height:2;">
    (1) Тус үйлчилгээг ашиглахын тулд та өөрийн акаунтад нууц үг тохируулах шаардлагатай.
    <br>
    (2) Та өөрийн бүртгэлтэй холбоотой нууц үгээ хариуцах үүрэгтэй. Нууц үгээ гуравдагч этгээдэд алдахгүйн тулд нууц үгээ зөв хадгалж, ашиглахгүй, бусдад мэдэгдэхгүй байхыг анхаарна уу.
    <br>
    (3) Үйлчилгээнд нэвтрэх үед оруулсан нууц үгийг хэрэглэгч өөрөө оруулсан гэж тооцно. Нэвтрэх үед нууц үгээ оруулснаар хэрэглэгч өөрөө үйлчилгээг ашиглаж байна гэж үзнэ.
    <br>
    (4) Хэрэв та нууц үгээ мартсан бол үйлчилгээнд заасан журмын дагуу нууц үгээ шинэчлэх боломжтой. Гэсэн хэдий ч, хэрэглэгчийн хувийн мэдээллийг баталгаажуулах боломжгүй эсвэл үйлчилгээ ашиглалтын нөхцлийг зөрчсөн гэж үзвэл бид таны нууц үгийг шинэчлэх боломжгүй байх тохиолдол гарч болзошгүй.
    <br>
    (5) Хэрэглэгчид нууц үгээ тогтмол солихыг зөвлөж байна.
    <br>
    </div>
    <br>
    3 Үйлчилгээ үзүүлсэн
<br>
(1) Компани нь хэрэглэгчдэд интернет орчноор дамжуулан үйлчилгээ үзүүлдэг бөгөөд хэрэглэгч өөрийн хариуцлага, зардлаар уг үйлчилгээг ашиглахад шаардлагатай орчныг(цаашид ""ашиглах орчин"" гэх) бэлтгэнэ.
    <br>
    (2) Ашиглах орчинд дараахь зүйлс орно.
    <div style="margin-left: 30px;line-height:2;">
    (a) Техник хангамж
    <br>
    (b) Програм хангамж
    <br>
    (c) Интернет холболт
    <br>
    (d) Үйл ажиллагааны орчны аюулгүй байдлыг хангах
    <br>
    (e) Үйлчилгээг ашиглахад шаардлагатай бусад орчин
    <br>
    </div>
    <br>
    4 Үйлчилгээний тасалдал
    Компани нь дараах тохиолдолд үйлчилгээ үзүүлэхээ түр зогсоож болно.
<br>
<div style="margin-left: 30px;line-height:2;">
(a) Системийн засвар үйлчилгээ эсвэл шинэчлэлтийн үед.
<br>
(b) Гал түймэр, эрчим хүчний доголдол, байгалийн гамшиг гэх мэт давагдашгүй хүчин зүйлийн улмаас үйлчилгээ үзүүлэхэд хүндрэлтэй үед.
<br>
(c) Аюулгүй байдлын эрсдэл, гадны халдлага гэх мэт.
<br>
(d) Бусад шаардлагатай тохиолдолд.
<br>
</div>
<br>
5 Хориглох зүйлс 
<br>
Хэрэглэгчид энэ үйлчилгээг ашиглахдаа дараах үйлдлийг хийхийг хориглоно.
<br>
<div style="margin-left:30px;line-height:2;">
(a) Хууль тогтоомж, нийтийн хэв журам, ёс суртахууныг зөрчсөн үйлдэл
    <br>
    (b) Бусдын хувийн болон нууц мэдээллийг зөвшөөрөлгүйгээр цуглуулах
    <br>
    (c) Энэ үйлчилгээний үйл ажиллагаанд саад учруулсан үйлдлүүд
    <br>
    (d) Үйлчилгээг ашиглахтай холбогдуулан зохисгүй гэж үзсэн бусад үйлдлүүд.
    <br>
</div>
<br>
6 Үнэ
<br>
Одоогийн байдлаар энэ үйлчилгээг ашиглах нь үнэ төлбөргүй. Гэсэн хэдий ч бид ямар ч үед хураамж нэвтрүүлэх эрхтэй бөгөөд хураамж тогтоосон тохиолдолд танд урьдчилан мэдэгдэх болно.
<br>
<br>
7 Татгалзах
<br>
<div style="margin-left:30px;line-height:2;">
(1) Энэ үйлчилгээг ашигласнаар хэрэглэгчдэд учирсан хохирлыг бид хариуцахгүй.
<br>
(2) Үйлчилгээг ашигласнаар хэрэглэгч гуравдагч этгээдэд учруулсан хохирлыг компани хариуцахгүй.
<br>
(3) Хэрэв компани нь зайлшгүй шалтгаанаар үйлчилгээгээ түр зогсоосон эсвэл цуцалсан бол компани нь үүнээс үүдэн учирсан хохирол, хохирол болон бусад зардлыг нөхөн төлөх, нөхөн төлөхөөс чөлөөлөгдөнө.
<br>
</div>
<br>
8 Үйлчилгээний нөхцлийн өөрчлөлт
<div style="margin-left:30px;line-height:2;">
(1) Компани шаардлагатай бол эдгээр нөхцөлийг хүссэн үедээ өөрчилж болно.
<br>
(2) Өөрчлөгдсөн нөхцөлийг компаниас зохих журмын дагуу хэрэглэгчдэд мэдэгдэх бөгөөд энэ үеэс эхлэн хүчин төгөлдөр болно.
<br>
(3) Хэрэв хэрэглэгч энэ гэрээг өөрчлөхийг зөвшөөрөхгүй бол хэрэглэгч энэ үйлчилгээг ашиглахаа зогсоож болно. Гэсэн хэдий ч, хэрэв хэрэглэгч энэ үйлчилгээг өөрчилсөн нөхцөлийн дагуу ашиглах юм бол хэрэглэгч өөрчлөгдсөн нөхцөлийг зөвшөөрсөнд тооцогдоно.
<br>
</div>
<br>
9 Бүртгэл устгах
<br>
Хэрэглэгчид хүссэн үедээ бүртгэлээ устгах боломжтой. Хэрэв та бүртгэлээ устгавал бүртгэлийн мэдээлэл, ашиглалтын түүх зэрэг бүх мэдээлэл устах болно.
<br>
Гэсэн хэдий ч, хэрэв хэрэглэгч эдгээр нөхцлийг зөрчсөн эсвэл Компани үүнийг зохисгүй гэж үзвэл хэрэглэгчийн бүртгэлийг устгаж болно.
<br>
<br>
10 Мэдээлэл боловсруулах
<br>
<div id="data-handling">
<div style="margin-left:30px;line-height:2;">
</div>
(1) Хэрэглэгч үйлчилгээг ашиглах үед компани ашиглалтын байдал, үйл ажиллагааны түүх зэрэг мэдээллийг цуглуулж болно. Компани энэ мэдээллийг хэрэглэгчийн хувийн мэдээллийг ашиглалгүйгээр боловсруулалт хийх, статистик гаргах боломжтой.
<br>
(2) Хэрэглэгчид үйлчилгээг ашиглах үед Компанийн цуглуулсан хувийн мэдээллийг Компанийн <a :href="$store.state.baseLocation + '/support/docs/en/privacy-policy'">"Нууцлалын бодлого"</a>-ын дагуу зохицуулна.
<br>
(3) Хэрэглэгч үйлчилгээг ашиглахдаа өгөгдлийг хадгалахын тулд компаниас тогтоосон санах ойг хэрэглэнэ. Энэхүү санах ойг ашигласнаар хэрэглэгч нь компанийг өгөгдөл хадгалахыг зөвшөөсөнд тооцно.
<br>
(4) Компани нь хэрэглэгчдийн үйлчилгээнд хадгалагдаж буй мэдээллийн талаар зохих менежментийн арга хэмжээ авна. Гэхдээ мэдээлэл алдагдсан, устгагдсан гэх мэт тохиолдолд Компани хариуцлага хүлээхгүй.
<br>
(5) Үйлчилгээг ашиглахдаа хэрэглэгч нь гуравдагч этгээдийн зохиогчийн эрх, барааны тэмдгийн эрх, хувийн нууцлалын эрхийг зөрчөөгүй гэдгийг баталгаажуулна. Хэрэв компани гуравдагч этгээдээс эрх зөрчигдсөн тухай нэхэмжлэлийг хүлээн авбал хэрэглэгч үүнийг өөрийн хариуцлага, зардлаар шийдвэрлэнэ.
<br>
(6) Компанийн хадгалсан өгөгдөлтэй холбоотой эрх нь хэрэглэгч уг үйлчилгээг ашигласнаар компанид хамаарна. Гэсэн хэдий ч бид хэрэглэгчдэд тусад нь мэдэгдэхгүй бол хадгалсан өгөгдлийг гуравдагч этгээдэд өгөхгүй.
<br>
(7) Гэрээ дуусгавар болсон ч гэсэн компани нь хэрэглэгчийн хадгалсан өгөгдлийг Компанийн хариуцлагын дагуу хадгалах боломжтой.
</div>
<br>
11 Оюуны өмчийн эрх
Үйлчилгээтэй холбоотой зохиогчийн эрх, барааны тэмдгийн эрх, патентын эрх болон бусад оюуны өмчийн эрх нь Компани эсвэл Компанид лиценз олгосон гуравдагч этгээдэд хамаарна. Хэрэглэгч бидний урьдчилан зөвшөөрөлгүйгээр эдгээр эрхийг зөрчсөн аливаа үйлдэл хийхийг хориглоно.
<br>
<br>
12 Энэхүү гэрээний холбогдох хууль
<br>
<div style="margin-left:30px;line-height:2;">
(1) Эдгээр нөхцөлийг Японы хууль тогтоомжийн дагуу тогтоов.
(2) Хэрэглэгч Японоос гадуур оршин суудаг байсан ч хэрэглэгч энэ үйлчилгээг ашиглахаасаа өмнө энэхүү гэрээний агуулгыг ойлгож, зөвшөөрөх ёстой. Үйлчилгээг тухайн хэрэглэгчийн оршин суугаа улсын хууль тогтоомж, олон улсын гэрээний дагуу ашиглах бөгөөд уг үйлчилгээг тухайн хууль тогтоомж, гэрээг зөрчөөгүй хэмжээнд ашиглаж болно.
</div>
<br>
13 Хувийн мэдээлэлтэй харьцах
<br>
Манай компани энэ үйлчилгээнд хамрагдсан хэрэглэгчдийн хувийн нууцыг хүндэтгэж, хувийн мэдээллийг нууцлалын бодлогын дагуу зохицуулдаг бөгөөд хэрэглэгчид үүнийг урьдчилан зөвшөөрөх ёстой.
<br>
<br>
14 Хохирол нэхэмжлэх
<br>
Хэрэв хэрэглэгч эдгээр нөхцлийн заалтыг зөрчиж, Компанид хохирол учруулсан бол Компани нь хэрэглэгчийн эсрэг хохирлыг (өмгөөллийн төлбөрийг оруулаад) нэхэмжилж болно.
<br>
<br>
15 Маргаан шийдвэрлэх
<br>
Хэрэглэгч болон Компани нь маргаантай байгаа хэмжээнээс хамааран эдгээр Нөхцөлтэй холбоотой маргааныг анхан шатны шүүхийн хувьд Фүкүока дүүргийн шүүх буюу Фүкүока дүүргийн шүүхийн онцгой эрх мэдлийг зөвшөөрнө.
<br>
<br>
16 Нийгмийн эсрэг хүчинд хариу үйлдэл үзүүлэх
<br>
Зохион байгуулалттай гэмт хэргээс урьдчилан сэргийлэх тухай журмын дагуу зохион байгуулалттай гэмт бүлэглэлд холбогдсон хүмүүс энэ үйлчилгээг ашиглахыг хориглоно."
</div>

@endsection