Таны "{{$board_title}}" чат {{$delete_date}} өдөр устгагдахаар төлөвлөгдсөн байна. 

{{$last_act}} өдрөөс хойш чатад ямар нэг идэвхтэй үйл ажиллагаа явагдаагүй тул ашиглах журмын дагуу устгагдах болно. 

Хэрэв та чатыг хэвээр үлдээх хүсэлтэй бол дараах хаягаар чатад нэвтэрч арга хэмжээ авна уу {{url('chat/' . $board_id)}}.

Автомат устгалын талаар илүү дэлгэрэнгүйг: {{url('support/docs/' . $language . '/terms-of-service')}}.

Хэрэв танд ямар нэг асуудал тулгарсан бол тусламж хэсэгт хандана уу {{url('help')}}.