<template>
    <div class="overlay" @mousedown="emit('close')">                         
        <div class="chatCreate" @mousedown.stop style="overflow: hidden auto;">     
            <div class="recordFormTitle" style="display:flex">
                <div class="m-close-button" @click="emit('close')" style="position:unset; margin:auto 0 auto auto">
                    <svg version="1.1" xmlns="http://www.w3.org/2000/svg" class="modalWindowCloseButton" viewBox="0 0 32 32">
                        <path d="M31.165 28.569l-1.67-1.855-1.681-1.841-6.777-7.318c-0.362-0.387-0.964-1.006-1.363-1.412-0.227-0.23-0.227-0.594-0.001-0.826 0.397-0.408 0.993-1.023 1.355-1.409 1.133-1.215 2.25-2.446 3.378-3.667l3.375-3.674c1.12-1.227 2.233-2.463 3.335-3.709 0.569-0.64 0.583-1.621 0-2.278-0.629-0.712-1.715-0.779-2.426-0.15-1.247 1.103-2.482 2.218-3.711 3.338l-3.672 3.374c-1.222 1.128-2.453 2.246-3.669 3.378-0.49 0.456-0.967 0.925-1.447 1.394-0.211 0.206-0.551 0.206-0.765 0-0.48-0.469-0.957-0.938-1.448-1.394-1.213-1.13-2.443-2.248-3.665-3.375l-3.672-3.374c-1.23-1.121-2.465-2.234-3.711-3.338-0.641-0.566-1.621-0.582-2.279 0-0.712 0.63-0.779 1.717-0.149 2.428 1.103 1.247 2.218 2.482 3.336 3.709l3.375 3.674c1.127 1.222 2.244 2.453 3.378 3.667 0.36 0.385 0.957 1.002 1.354 1.409 0.227 0.232 0.225 0.597-0.001 0.826-0.401 0.406-1.002 1.024-1.363 1.412l-3.389 3.655-3.388 3.661-1.682 1.841-1.668 1.855c-0.6 0.669-0.615 1.707 0 2.392 0.661 0.732 1.789 0.792 2.522 0.131l1.855-1.667 1.841-1.682 7.318-6.776c0.487-0.455 0.959-0.922 1.432-1.389 0.214-0.209 0.557-0.209 0.769 0 0.476 0.466 0.949 0.934 1.433 1.389l7.318 6.776 1.841 1.682 1.855 1.667c0.671 0.602 1.707 0.618 2.392 0 0.736-0.659 0.796-1.789 0.135-2.522z"></path>
                    </svg>                        
                </div> 
            </div>      
            <p style="white-space: break-spaces;
    line-height: 1.5;
    font-size: 16px;" v-html="text">
</p>
    </div>
</div>
</template>
<script setup lang="ts">
const emit = defineEmits<{
    close: []
}>()
const text = `<h3>研修プログラムについて</h3>
この研修プログラムは、社会活動で必要とされる9つの職能を学ぶことを目的としています。以下に、プログラムの流れについて詳しく説明します。

<strong>1.GLOWDラーニングアプリによる基礎学習：</strong>
-参加者はまず、GLOWDのラーニングアプリを使用して基礎学習を行います。
-この段階では、9つの職能に関連する基本的な知識やスキルを学びます。

<strong>2.サポートとフォローアップ：</strong>
-もし基礎学習の内容が理解しにくい場合、補足資料を参照したり、フォローアップ面談を通じてサポートを受けることができます。
-これにより、参加者は自分のペースで学習を進めることができます。

<strong>3.ポートフォリオの作成：</strong>
-基礎学習を理解した参加者は、グループディスカッションの準備のためにポートフォリオを作成します。
-ポートフォリオには、学んだことの要約や、自身の考えや経験を反映させます。

<strong>4.グループディスカッションとフィードバック：</strong>
-ディスカッションでは、ポートフォリオを発表し、他の参加者や指導者からのポジティブ（肯定的）およびネガティブ（否定的）なフィードバックを受けます。
-このフィードバックをもとに、ポートフォリオをさらに磨き上げます。

<strong>5.ポートフォリオの公開と履修完了：</strong>
-完成したポートフォリオは、各参加者のマイページのプロフィール欄に自動的に掲載されます。
-基礎学習を完了し、ポートフォリオが完成した参加者は、1つのテーマの履修が完了したとみなされます。

このプログラムは、職能を体系的に学び、実践的なスキルを身につけることを目指しています。参加者は自己の学びを深め、自己表現のスキルを磨くことができます。

<h3>ポートフォリオとは</h3>

ポートフォリオとは、自身の学びや経験を体系的にまとめた文書です。これは、ご自身の能力と成長を記録し、可視化するための重要なツールです。ポートフォリオの作成には以下のステップが含まれます。

<strong>1.学習内容の整理：</strong>
まず、研修プログラムや業務で学んだ知識やスキルを整理します。どのような新しいことを学んだのか、どのような理解を深めたのかを明記します。

<strong>2.過去の経験の反映：</strong>
以前に経験したプロジェクトや業務での成功や挑戦、そこから得た教訓を記載します。これにより、ご自身の経験がどのように現在の職務に役立っているかを示すことができます。

<strong>3.個人の特性と主張：</strong>
自己分析を通じて自覚した自身の強みや特性、個人的な見解や考え方を明確にします。これは、個人としてのユニークな価値や視点を表現するために重要です。

<strong>4.フィードバックの統合：</strong>
研修中や業務中に受けた指導や助言をポートフォリオに取り入れ、自己改善の過程を示します。

ポートフォリオを作成することは、自己の成長を振り返り、今後のキャリアパスを考える上で非常に有効です。また、自分自身の能力や業績を上司や同僚に伝える際にも役立ちます。このプロセスを通じて、皆様は自己の能力をより深く理解し、自信を持って業務に取り組むことができるようになるでしょう。`
</script>
